Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/MultilingualResources/zhushou_jiami_jiemi.*.xlf
Languages: de, fr, ja_jp, zh_hant

# String9
source: When entering a password, make sure that the password is entered twice and is less than 60 characters long
de: Nutzung
fr: utilisation
ja_jp: 付き
zh_hant: 入侵程式

# textblock.Text
source: Usage
de: Nutzung
fr: utilisation
ja_jp: 付き
zh_hant: 入侵程式

# textblock3.Text
source: Or
de: Passwort eingeben (optional)
fr: Entrez un mot de passe (facultatif)
ja_jp: パスワードを入力する (オプション)
zh_hant: 輸入密碼（可選）

# button1.Content
source: Encoding
de: Verschlüsselung
fr: chiffrement
ja_jp: 暗号化
zh_hant: 加密

# button2.Content
source: Decrypt
de: entschlüsseln
fr: déchiffrer
ja_jp: 解読する
zh_hant: 解密

# combobox.Header
source: Encryption/decryptmode:
de: Verschlüsselung/Entschlüsselungsmodus:
fr: Chiffrement/décryptage :
ja_jp: 暗号化/復号化モード:
zh_hant: 加密/解密模式：

# combobox1.Header
source: Encryption/decryption algorithm:
de: Verschlüsselungs-/Entschlüsselungsalgorithmus:
fr: Algorithme de chiffrement/décryptage :
ja_jp: 暗号化/復号化アルゴリズム:
zh_hant: 加密/解密演算法：

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Anwendung mit Nicht-Speicher kann Dateien, die größer als (390 MB) sind, nicht verschlüsseln, bleiben für nachfolgende Updates optimiert
fr: Application avec hors de la mémoire ne peut pas chiffrer les fichiers plus grands que (390 Mo), restez à l'écoute pour les mises à jour ultérieures
ja_jp: メモリ不足のアプリケーションは(390MB)より大きいファイルを暗号化することはできません、その後の更新にご期待ください
zh_hant: 應用記憶體不足無法加密大於（390MB）的檔，敬請期待後續更新

# String10
source: Please go to the home page to decrypt this file<Version is higher than1.3.711>
de: Bitte gehen Sie zur Startseite, um diese Datei zu entschlüsseln<版本高于1.3.711>
fr: S'il vous plaît aller à la page d'accueil pour déchiffrer ce fichier<版本高于1.3.711>
ja_jp: このファイルを復号化するには、ホーム ページに移動してください。<版本高于1.3.711>
zh_hant: 請前往主頁解密此檔<版本高於1.3.711>

# String11
source: Failed to read file version
de: Fehler beim Lesen der Dateiversion
fr: Défaut de lecture de la version du fichier
ja_jp: ファイル のバージョンを読み取りできませんでした
zh_hant: 嘗試讀取檔版本失敗

# String12
source: There is a problem decrypting, please ensure that the decryption key, decryption mode, decrypttheor algorithm correctness, check again. If you've seen this tip many times, please report this question to us in the Feedback Center, thank you
de: Es gibt ein Problem entschlüsseln, stellen Sie bitte sicher, dass der Entschlüsselungsschlüssel, Entschlüsselungsmodus, decrypttheor Algorithmus Korrektheit, überprüfen Sie erneut. Wenn Sie diesen Tipp schon oft gesehen haben, melden Sie uns diese Frage bitte im Feedback Center, danke
fr: Il ya un problème de décryptage, s'il vous plaît assurez-vous que la clé de décryptage, mode de décryptage, décryptage de l'algorithme correcteur, vérifier à nouveau. Si vous avez vu cette astuce plusieurs fois, s'il vous plaît rapportcette question à nous dans le centre de rétroaction, je vous remercie
ja_jp: 復号化に問題がありますので、復号化キー、復号化モード、復号化アルゴリズムの正確性を確認し、もう一度確認してください。 このヒントを何度も見たことがある場合は、フィードバックセンターでこの質問を報告してください。
zh_hant: 解密時出現問題，請確保解密密匙，解密模式，解密演算法的正確性，核對後請重試。 如果你看到過這個提示很多次，請在回饋中樞把這個問題報告給我們，謝謝

# String13
source: Decryptsuccessful, click on the picture below to save
de: Decryptsuccessful, klicken Sie auf das Bild unten zu speichern
fr: Décrypte, cliquez sur l'image ci-dessous pour enregistrer
ja_jp: 復号化に成功し、下の写真をクリックして保存してください。
zh_hant: 解密成功，點擊下面的圖片保存

# String14
source: Please click on the picture above to select the file to decrypt
de: Bitte klicken Sie auf das Bild oben, um die zu entschlüsselnde Datei auszuwählen
fr: S'il vous plaît cliquez sur l'image ci-dessus pour sélectionner le fichier à déchiffrer
ja_jp: 復号化に成功し、下の写真をクリックして保存してください。 ...
zh_hant: 請點擊上面的圖片選擇要進行解密的檔

# String15
source: There was a problem saving the results, please try again. If this prompt still appears after trying again many times, please feed us back to this issue and we will try our best to resolve it, thank you
de: Es ist ein Problem beim Speichern der Ergebnisse vorliegt, versuchen Sie es bitte erneut. Wenn diese Eingabeaufforderung immer noch erscheint, nachdem Sie es noch viele Male versucht haben, füttern Sie uns bitte zurück zu diesem Problem und wir werden unser Bestes tun, um es zu lösen, danke
fr: Il y avait un problème d'enregistrement des résultats, s'il vous plaît essayer à nouveau. Si cette invite apparaît encore après avoir essayé à nouveau plusieurs fois, s'il vous plaît nous nourrir de nouveau à cette question et nous ferons de notre mieux pour le résoudre, je vous remercie
ja_jp: 結果の保存に問題がありましたので、もう一度やり直してください。 何度も繰り返した後にこのプロンプトがまだ表示される場合は、この問題に戻って私たちを養い、我々はそれを解決するために最善を尽くします、ありがとうございました
zh_hant: 請點擊上面的圖片選擇要進行解密的檔

# String16
source: Save successful
de: Speichern erfolgreich
fr: Enregistrement réussi
ja_jp: 正常に保存されました
zh_hant: 儲存成功

# String17
source: Please encrypt/decrypt first
de: Bitte zuerst verschlüsseln/entschlüsseln
fr: S'il vous plaît crypter / décrypter d'abord
ja_jp: 最初に暗号化/復号化してください
zh_hant: 請先進行加密/解密

# String18
source: Congratulations, the key length has reached the required 40 characters
de: Herzlichen Glückwunsch, die Schlüssellänge hat die erforderlichen 40 Zeichen erreicht
fr: Félicitations, la longueur de clé a atteint les 40 caractères requis
ja_jp: おめでとうございます、キーの長さは必要な40文字に達しました
zh_hant: 恭喜你，密匙長度已經達到要求的40個字元

# String19
source: Congratulations, the key length has reached the required 40 characters
de: Herzlichen Glückwunsch, die Schlüssellänge hat die erforderlichen 40 Zeichen erreicht
fr: Félicitations, la longueur de clé a atteint les 40 caractères requis
ja_jp: おめでとうございます、キーの長さは必要な40文字に達しました
zh_hant: 恭喜你，密匙長度已經達到要求的40個字元

# String2
source: Paste successful
de: Die Länge des Schlüssels muss 40 sein, überprüfen Sie bitte den Schlüssel
fr: La longueur de la clé doit être de 40, s'il vous plaît vérifier la clé
ja_jp: キーの長さは40でなければなりませんので、鍵を確認してください
zh_hant: 密匙長度必須是40，請核對密匙

# String20
source: Password is too long, should be between 0 to 20 characters
de: Das Kennwort ist zu lang, sollte zwischen 0 und 20 Zeichen liegen
fr: Mot de passe est trop long, doit être entre 0 à 20 caractères
ja_jp: パスワードが長すぎる、0 ~ 20 文字の間にする必要があります
zh_hant: 密碼過長，應在0~20字元之間

# String21
source: Your passwords do not match
de: Ihre Kennwörter stimmen nicht überein.
fr: Vos mots de passe ne correspondent pas.
ja_jp: パスワードが一致しません
zh_hant: 您的密碼不符

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Stellen Sie beim Festlegen eines Kennworts sicher, dass das zweimal eingegebene Kennwort identisch ist und weniger als 60 Zeichen lang ist.
fr: Lorsque vous définiz un mot de passe, assurez-vous que le mot de passe entré deux fois est le même et est inférieur à 60 caractères de long
ja_jp: パスワードを設定する場合は、2 回入力したパスワードが同じで、60 文字未満であることを確認します。
zh_hant: 設置密碼時，請確保兩次輸入的密碼一致，且長度小於60個字元

# String4
source: Please set the password before encrypting
de: Wenn es ein Problem mit der Verschlüsselung gibt, stellen Sie bitte sicher, dass der Verschlüsselungsschlüssel, der Verschlüsselungsmodus, der Verschlüsselungsalgorithmus korrekt ist, überprüfen Sie erneut. Wenn Sie diesen Tipp schon oft gesehen haben, melden Sie uns diese Frage bitte im Feedback Center, danke
fr: Lorsqu'il y a un problème de chiffrement, assurez-vous que la clé de chiffrement, le mode de cryptage, l'algorithme de cryptage sont corrects, vérifiez à nouveau. Si vous avez vu cette astuce plusieurs fois, s'il vous plaît rapportcette question à nous dans le centre de rétroaction, je vous remercie
ja_jp: 暗号化に問題がある場合は、暗号化キー、暗号化モード、暗号化アルゴリズムが正しいことを確認し、もう一度確認してください。 このヒントを何度も見たことがある場合は、フィードバックセンターでこの質問を報告してください。
zh_hant: 加密時出現問題，請確保加密密匙，加密模式，加密演算法的正確性，核對後請重試。 如果你看到過這個提示很多次，請在回饋中樞把這個問題報告給我們，謝謝

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Verschlüsselung war erfolgreich, klicken Sie auf das Bild unten, um zu speichern
fr: Le chiffrement a été un succès, cliquez sur l'image ci-dessous pour enregistrer
ja_jp: 暗号化に成功しました, 保存するには、下の写真をクリックしてください
zh_hant: 加密成功，點擊下面的圖片保存

# String6
source: This text cannot be decrypted, make sure the decryption key and algorithm are correct
de: Bitte klicken Sie auf das Bild oben, um die zu verschlüsselnde Datei auszuwählen.
fr: Veuillez cliquer sur l'image ci-dessus pour sélectionner le fichier à chiffrer.
ja_jp: 上の画像をクリックして、暗号化するファイルを選択してください。
zh_hant: 請點擊上面的圖片選擇要進行加密的檔。

# String7
source: Password error, please confirm and try again
de: Anwendung mit Nicht-Arbeitsspeicher kann Dateien größer als (390MB) nicht entschlüsseln, bleiben auf nachfolgende Updates eingestellt
fr: Application avec hors de la mémoire ne peut pas déchiffrer les fichiers plus grands que (390 Mo), restez à l'écoute pour les mises à jour ultérieures
ja_jp: メモリ不足のアプリケーションは、(390MB)より大きいファイルを復号化することはできません、その後の更新にご期待ください
zh_hant: 應用記憶體不足無法解密大於（390MB）的檔，敬請期待後續更新

# String8
source: Replication successful
de: Die Länge des Schlüssels muss 40 sein, überprüfen Sie bitte den Schlüssel
fr: La longueur de la clé doit être de 40, s'il vous plaît vérifier la clé
ja_jp: キーの長さは40でなければなりませんので、鍵を確認してください
zh_hant: 密匙長度必須是40，請核對密匙

# String9
source: When entering a password, make sure that the password is entered twice and is less than 60 characters long
de: Stellen Sie bei der Eingabe eines Kennworts sicher, dass das Kennwort zweimal eingegeben wird und weniger als 60 Zeichen lang ist.
fr: Lorsque vous saisiz un mot de passe, assurez-vous que le mot de passe est entré deux fois et est de moins de 60 caractères de long
ja_jp: パスワードを入力する場合は、パスワードを 2 回入力し、60 文字未満であることを確認します。
zh_hant: 輸入密碼時，請確保兩次輸入的密碼一致，且長度小於60個字元

# textblock2.Text
source: Decrypting results
de: 1.3.711 Versionsverschlüsselung/-entschlüsselung
fr: 1.3.711 Chiffrement/Décryptage de la version
ja_jp: 1.3.711 バージョン暗号化/復号化
zh_hant: 1.3.711版本 加密/解密

# textblock3.Text
source: Or
de: Dateien, die verschlüsselt/entschlüsselt werden müssen
fr: Fichiers qui doivent être cryptés/décryptés
ja_jp: 1.3.711 バージョン暗号化/復号化 ...
zh_hant: 需要加密/解密的檔

# textblock5.Text
source: Add a Folder
de: Hinweis: Um einer Datei ein Kennwort hinzuzufügen, ändern Sie den Verschlüsselungs-/Entschlüsselungsmodus in den normalen Modus. Da der Schlüssel aus 40 0s oder 1s besteht, ist er leicht falsch zu lesen, daher wird der Standardschlüssel empfohlen. Und in den meisten Fällen können Verschlüsselungs-/Entschlüsselungsschlüssel und algorithmische Fehler nicht erkannt werden und werden nur von Ihnen erkannt, wenn Sie Dateien verwenden. Es gibt mehrere /u008 Zeichen am Ende einiger der entschlüsselten Dateien, und unsere umfangreichen Tests zeigen, dass dies nicht die Verwendung beeinflussen wird, bitte sicher sein.
fr: Remarque : Pour ajouter un mot de passe à un fichier, changez le mode de cryptage/décryptage en mode normal. Étant donné que la clé est composée de 40 0 ou 1, il est facile de mal lire, de sorte que la clé par défaut est recommandée. Et dans la plupart des cas, les clés de chiffrement/décryptage et les erreurs algorithmiques ne peuvent pas être détectées et ne sont découvertes par vous que lorsque vous utilisez des fichiers. Il ya plusieurs /u008 caractères à la fin de certains des fichiers décryptés, et nos tests approfondis montre que cela n'affectera pas l'utilisation, s'il vous plaît être assuré.
ja_jp: 注: ファイルにパスワードを追加するには、暗号化/復号化モードを通常モードに変更します。 キーは 40 0 または 1 で構成されているので、読み間違いやすいので、既定のキーをお勧めします。 また、ほとんどの場合、暗号化/復号化キーとアルゴリズム エラーは検出できず、ファイルを使用している場合にのみ検出されます。 復号化されたファイルの末端には複数の /u008 文字があり、広範なテストでは使用に影響を与えないことが示されています。
zh_hant: 注意：若要給檔添加密碼，請更改加密/解密模式為 普通模式 。 由於密匙是40個0或1組成的，很容易看錯，所以建議使用預設密匙。 且在大部分情況下，加密/解密密匙和演算法錯誤無法檢測到，只有在使用檔時才會被你發現。 部分被解密的檔的末尾存在多個/u008字元，我們大量的測試表明這不會影響使用，請放心。

# textblock7.Text
source: Results here, click Save
de: Ergebnisse hier, klicken Sie auf Speichern
fr: Résultats ici, cliquez sur Enregistrer
ja_jp: 結果はこちらの場合、[保存] をクリックします。
zh_hant: 結果在這，點擊保存

# textbox2.Header
source: Custom key:
de: Benutzerdefinierter Schlüssel:
fr: Clé personnalisée :
ja_jp: カスタム キー：
zh_hant: 自訂密匙：

# textbox2.PlaceholderText
source: Click on the button below to enter the key
de: Klicken Sie auf die Schaltfläche unten, um den Schlüssel einzugeben
fr: Cliquez sur le bouton ci-dessous pour entrer la clé
ja_jp: 下のボタンをクリックしてキーを入力します。
zh_hant: 點擊下面的按鈕輸入密匙

# textbox3.Header
source: password
de: Kennwort
fr: mot de passe
ja_jp: パスワード
zh_hant: 密碼

# textbox3.PlaceholderText
source: Set an encrypted password, or enter a decryption password
de: Festlegen eines verschlüsselten Kennworts oder Eingeben eines Entschlüsselungskennworts
fr: Définir un mot de passe chiffré ou entrer un mot de passe de décryptage
ja_jp: 暗号化されたパスワードを設定するか、復号化パスワードを入力します。
zh_hant: 設置加密密碼，或輸入解密密碼

# textbox4.Header
source: Confirm password
de: Kennwort wiederholen
fr: Confirmer le mot de passe
ja_jp: パスワードの再入力
zh_hant: 確認密碼

# textbox4.PlaceholderText
source: Enter the encryption/decryptpassword again
de: Geben Sie das Verschlüsselungs-/Entschlüsselungskennwort erneut ein.
fr: Entrez à nouveau le chiffrement/décrypteur
ja_jp: 暗号化/復号化パスワードをもう一度入力します。
zh_hant: 再次輸入加密/解密密碼

# textmcc.Text
source: Use the default encryption/decryption key (recommended)
de: Verwenden des Standardverschlüsselungs-/Entschlüsselungsschlüssels (empfohlen)
fr: Utiliser la clé de chiffrement/décryptage par défaut (recommandé)
ja_jp: 既定の暗号化/復号化キーを使用する (推奨)
zh_hant: 使用預設加密/解密密匙（推薦）
