Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/MultilingualResources/zhushou_jiami_jiemi.*.xlf
Languages: de, fr, ja_jp, zh_hant

# textblock16.Text
source: Next
de: Konzept: Das Passwort hat hier keinen Einfluss auf die Gesamtverschlüsselung der Datei, d.h. unabhängig vom Passwort ist die verschlüsselte Datei im Wesentlichen gleich. So ist das Passwort nur innerhalb dieser App als Funktion der Identitätsüberprüfung und kann die Datei nicht schützen, um die Datei zu schützen, ändern Sie bitte den Schlüssel。
fr: Concept: Le mot de passe ici n'affecte pas le chiffrement global du fichier, c'est-à-dire, peu importe ce que le mot de passe est, le fichier crypté est essentiellement le même. Ainsi, le mot de passe est seulement à l'intérieur de cette application en fonction de la vérification d'identité et ne peut pas protéger le fichier, pour protéger le fichier s'il vous plaît modifier la clé。
ja_jp: 概念: ここでのパスワードは、ファイルの全体的な暗号化には影響しません。 だから、パスワードは、アイデンティティ検証の機能としてアプリ内にあり、ファイルを保護することはできません、ファイルを保護するために、キーを変更してください。
zh_hant: 概念：這裡的密碼並不會影響檔整體的加密情況，也就是說無論密碼是什麼，加密後的檔本質都是一樣的。 因此密碼只在這個應用內部作為驗證身份的功能而不能保護檔，要想保護檔請修改密匙。

# textblock17.Text
source: Concept: The password here does not affect the overall encryption of the file, that is, no matter what the password is, the encrypted file is essentially the same. So the password is only inside this app as a function of identity verification and cannot protect the file, to protect the file please modify the key ...
de: Passwort festlegen: (1) Geben Sie das Passwort ein (2) klicken Sie auf (3) Geben Sie das Kennwort erneut ein (4) Stand-alone-Bestätigung (5) Stellen Sie den Kennwortfehler ein, nachdem der Eingabeaufforderungskennwortfehler erneut eingegeben werden kann, prompt dreimal kann das Kennwort zurückgesetzt werden, achten Sie darauf, das Passwort-Eingabefeld über dem Text zu beachten
fr: Définir le mot de passe: (1) Entrez le mot de passe (2) cliquez (3) Entrez le mot de passe à nouveau (4) confirmation autonome (5) définir l'erreur de mot de passe après l'erreur de mot de passe rapide peut être ré-entré, invitez trois fois peut réinitialer le mot de passe, prêter attention à observer la boîte d'entrée de mot de passe au-dessus du texte
ja_jp: パスワードを設定する:(1)パスワードを入力する(2)パスワードを再入力する(3)パスワードを再入力する(4)スタンドアロン確認(5)パスワードエラーを再入力した後にパスワードエラーを設定し、プロンプト3回パスワードをリセットすることができ、テキストの上のパスワード入力ボックスに注意してください
zh_hant: 設置密碼：（1）輸入密碼（2）按一下使用（3）再次輸入密碼（4）單機確認（5）設置成功（6）提示密碼錯誤後可以重新輸入，提示三次後可以重新設置密碼，注意觀察密碼輸入框上方文字

# textblock18.Text
source: Note: Passwords are stored with the same encryption algorithm and key encryption, meaning that a password error may be a decryption algorithm or a key error. There is no limit to the length of the password, and you can't enter it.
de: Hinweis: Kennwörter werden mit demselben Verschlüsselungsalgorithmus und der gleichen Schlüsselverschlüsselung gespeichert, was bedeutet, dass ein Kennwortfehler ein Entschlüsselungsalgorithmus oder ein Schlüsselfehler sein kann. Es gibt keine Begrenzung für die Länge des Kennworts, und Sie können es nicht eingeben.
fr: Remarque : Les mots de passe sont stockés avec le même algorithme de cryptage et le même chiffrement de clé, ce qui signifie qu'une erreur de mot de passe peut être un algorithme de décryptage ou une erreur de clé. Il n'y a pas de limite à la longueur du mot de passe, et vous ne pouvez pas l'entrer.
ja_jp: 注: パスワードは同じ暗号化アルゴリズムとキー暗号化で格納されるため、パスワード エラーは復号化アルゴリズムまたはキー エラーである可能性があります。 パスワードの長さに制限はなく、入力できません。
zh_hant: 設置密碼：（1）輸入密碼（2）按一下使用（3）再次輸入密碼（4）單機確認（5）設置成功（6）提示密碼錯誤後可以重新輸入，提示三次後可以重新設置密碼，注意觀察密碼輸入框上方文字 ...

# textblock19.Text
source: Previous
de: Geheimes Format
fr: Format secret
ja_jp: シークレット形式
zh_hant: 密文格式

# textblock2.Text
source: Decrypting results
de: Konzept: Ein Schlüssel ist ein Kennwort, das zu einem Verschlüsselungsalgorithmus gehört, und andere müssen den Schlüssel eingeben und einen übereinstimmenden Entschlüsselungsalgorithmus verwenden, um die Datei zu entschlüsseln. Da der Schlüssel Teil des Verschlüsselungsalgorithmus ist, bestimmt der verwendete Verschlüsselungsalgorithmus die maximale Länge des Schlüssels.
fr: Concept : Une clé est un mot de passe qui appartient à un algorithme de cryptage, et d'autres doivent entrer la clé et utiliser un algorithme de décryptage correspondant pour déchiffrer le fichier. Parce que la clé fait partie de l'algorithme de cryptage, l'algorithme de chiffrement utilisé détermine la longueur maximale de la clé
ja_jp: 概念: キーは暗号化アルゴリズムに属するパスワードであり、他のキーを入力し、一致する復号化アルゴリズムを使用してファイルを復号化する必要があります。 キーは暗号化アルゴリズムの一部であるため、どの暗号化アルゴリズムを使用して、キーの最大長が決定されます。
zh_hant: 概念：密匙就是屬於加密演算法的一個密碼，其他人必須通過輸入這個密匙並使用匹配的解密演算法才能解密檔。 因為密匙是加密演算法的一部分，所以採用何種加密演算法決定了密匙的最大長度

# textblock20.Text
source: Previous
de: Der verschlüsselte Text wird mit einem #的开头 ähnlich dem #1A2 verschlüsselt, wobei sichergestellt wird, dass alle Kopien kopiert werden, dass kein Zeichen entschlüsselt wird und dass seine detaillierte Konstruktion aus Sicherheitsgründen nicht besprochen wird.
fr: Le texte crypté est crypté avec un #的开头 similaire à la #1A2, en s'assurant que toutes les copies sont copiées, qu'aucun personnage n'est décrypté et que sa construction détaillée n'est pas discutée pour des raisons de sécurité.
ja_jp: 暗号化されたテキストは、#1A2に似た#的开头で暗号化され、すべてのコピーがコピーされ、1 文字が復号化されていない、およびセキュリティ上の理由から詳細な構築が議論されないようにします。
zh_hant: 加密文本後的密文會以類似于##1A2##的開頭，請確保全部複製，少了任何一個字元都無法解密，出於安全考慮不討論其詳細的構造。

# textblock21.Text
source: Other instructions on encryption
de: Weitere Anweisungen zur Verschlüsselung
fr: Autres instructions sur le chiffrement
ja_jp: 暗号化に関するその他の手順
zh_hant: 其他關於加密的說明

# textblock22.Text
source: 1. The size of the files that can be encrypted depends on your computer memory size and architecture, 32-bit operating system can be encrypted up to 400MB, 64-bit operating system can encrypt more than 1GB; Because the performance of each device is different, we do not set the file size limit, in order to decrypt normally Do not encrypt files at critical value size (test machine performance: Intel (R)Core (TM)) I5-5200U CPU 2.20GHz 2.20GHz, RAM 8GB, Windows 10 (x64) Pro 17763.253)
de: 1. Die Größe der Dateien, die verschlüsselt werden können, hängt von der Speichergröße und Architektur Ihres Computers ab, 32-Bit-Betriebssystem kann bis zu 400MB verschlüsselt werden, 64-Bit-Betriebssystem kann mehr als 1 GB verschlüsseln; Da die Leistung jedes Geräts unterschiedlich ist, legen wir die Dateigrößenbeschränkung nicht fest, um Dateien normalerweise nicht mit kritischer Wertgröße zu verschlüsseln (Testmaschinenleistung: Intel (R)Core (TM)) I5-5200U CPU 2.20GHz 2.20GHz, RAM 8GB, Windows 10 (x64) Pro 17763.253)
fr: 1. La taille des fichiers qui peuvent être cryptés dépend de la taille de votre mémoire d'ordinateur et de l'architecture, le système d'exploitation 32 bits peut être crypté jusqu'à 400 Mo, 64 bits système d'exploitation peut crypter plus de 1 Go; Parce que les performances de chaque appareil est différente, nous ne marquons pas la limite de taille des fichiers, afin de déchiffrer normalement Ne pas chiffrer les fichiers à la taille de la valeur critique (performance de la machine de test: Intel (R)Core (TM)) I5-5200U CPU 2.20GHz 2.20GHz, RAM 8GB, Windows 10 (x64) Pro 17763.253)
ja_jp: 1.暗号化できるファイルのサイズは、コンピュータのメモリサイズとアーキテクチャによって異なりますが、32ビットオペレーティングシステムは最大400MBまで暗号化することができ、64ビットオペレーティングシステムは1GB以上を暗号化できます。 各デバイスのパフォーマンスが異なるため、ファイルサイズの制限を設定しませんが、通常は重要な値サイズでファイルを暗号化しないでください(テストマシンのパフォーマンス:インテル(R)Core(TM))I5-5200U CPU 2.20GHz 2.20GHz、RAM 8GB、 Windows 10 (x64) プロ 17763.253
zh_hant: 1.可以加密的檔案大小取決於你的電腦記憶體大小和體系架構，32位作業系統最高可加密400MB，64位作業系統可加密1GB以上；加密時所需記憶體大致是檔案大小的3倍,如果檔太大會直接卡死，解決辦法是強行重啟 ；由於每台設備的性能不一樣，我們並沒有設置檔案大小上限；為了正常解密請不要加密處於臨界值大小的檔（測試機器性能：Intel(R)Core(TM)i5-5200U CPU@ 2.20GHz2.20GHz,RAM 8GB, Windows 10(x64)專業版 17763.253）

# textblock23.Text
source: 2. Remind the file to be encrypted: the encrypted file suffix will be modified to .lfjia, decrypted and returned to normal. Double-click decryption is under development
de: 2. Erinnern Sie die zu verschlüsselnde Datei: Das verschlüsselte Dateisuffix wird in .lfjia geändert, entschlüsselt und wieder normalisiert. Doppelklick-Entschlüsselung ist in der Entwicklung
fr: 2. Rappelez au fichier d'être crypté : le suffixe de fichier crypté sera modifié en .lfjia, décrypté et retourné à la normale. Le décryptage en double clic est en cours de développement
ja_jp: 2. 暗号化するファイルを思い出させる: 暗号化されたファイルサフィックスは .lfjia に変更され、復号化され、通常に戻されます。 ダブルクリック復号化は開発中です
zh_hant: 2.提醒檔被加密：加密後的檔尾碼名會被修改為.lfjia ，解密後恢復正常。 按兩下解密功能正在開發中

# textblock24.Text
source: 3. Record encrypted information: the encryption file will record the encryption algorithm and key, decrypting although the input of the wrong algorithm or key, will also be normal decryption, but the password input error will abort decryption.
de: 3. Aufzeichnung verschlüsselter Informationen: Die Verschlüsselungsdatei wird den Verschlüsselungsalgorithmus und Schlüssel aufzeichnen, entschlüsseln, obwohl die Eingabe des falschen Algorithmus oder Schlüssel, wird auch normale Entschlüsselung sein, aber das Passwort Eingabefehler wird die Entschlüsselung abbrechen.
fr: 3. Enregistrer les informations chiffrées: le fichier de chiffrement enregistrera l'algorithme de cryptage et la clé, décryptage bien que l'entrée du mauvais algorithme ou clé, sera également décryptage normal, mais l'erreur d'entrée de mot de passe va interrompre le décryptage.
ja_jp: 3.暗号化された情報を記録する:暗号化ファイルは、間違ったアルゴリズムやキーの入力も通常の復号化になりますが、暗号化アルゴリズムとキーを記録しますが、パスワード入力エラーは復号化を中止します。
zh_hant: 3.記錄加密資訊：加密檔中會記錄加密演算法和密匙，解密時儘管輸入的是錯誤的演算法或密匙，也會正常解密，但是密碼輸入錯誤後會中止解密。

# textblock25.Text
source: 4. Delete the source file: the deleted file after checking will not appear in the recycle bin, please think twice before enabling
de: 4. Löschen Sie die Quelldatei: die gelöschte Datei nach der Überprüfung wird nicht im Papierkorb angezeigt, bitte denken Sie zweimal nach, bevor Sie die Aktivierung
fr: 4. Supprimer le fichier source: le fichier supprimé après vérification n'apparaîtra pas dans le bac de recyclage, s'il vous plaît réfléchir à deux fois avant de activer
ja_jp: 4.ソースファイルを削除する:チェック後に削除されたファイルは、ごみ箱に表示されません、有効にする前にもう一度考えてください
zh_hant: 4.刪除原始檔案：勾選後刪除的檔不會出現在回收站中，請三思後啟用

# textblock26.Text
source: 5. Dual encryption: This feature is in response to a query (Jin Fan kingium.outlook.com). Version 1.4.12 has been extensively tested by developers and there is no case for replacing an encryption key or password. The introduction of this feature now rejects this possibility.
de: 5. Doppelte Verschlüsselung: Diese Funktion ist eine Antwort auf eine Abfrage (Jin Fan kingium.outlook.com). Version 1.4.12 wurde von Entwicklern ausgiebig getestet und es gibt keinen Grund, einen Verschlüsselungsschlüssel oder ein Passwort zu ersetzen. Die Einführung dieser Funktion lehnt diese Möglichkeit nun ab.
fr: 5. Double chiffrement : cette fonctionnalité est en réponse à une requête (Jin Fan kingium.outlook.com). La version 1.4.12 a été largement testée par les développeurs et il n'y a aucun cas pour remplacer une clé de chiffrement ou un mot de passe. L'introduction de cette fonctionnalité rejette maintenant cette possibilité.
ja_jp: 5.デュアル暗号化:この機能は、クエリ(jinファンkingium.outlook.com)に応答しています。 バージョン 1.4.12 は開発者によって広範囲にテストされており、暗号化キーやパスワードを置き換える場合はありません。 この機能の導入は、この可能性を拒否します。
zh_hant: 5.雙重加密：此功能是為了回應（Jin Fan kingium@outlook.com）的質疑。 1.4.12版本經過開發人員的大量測試，不存在替換加密密匙或密碼的情況。 現在引入這個功能更是否決了這個可能性。

# textblock27.Text
source: 6. This app calls UWP's own API, which is self-researching the encryption/decrypting C library
de: 6. Diese App ruft die eigene API der UWP auf, die die Verschlüsselung/Entschlüsselung der C-Bibliothek selbst recherchiert
fr: 6. Cette application appelle l'API d'UWP, qui fait des recherches sur la bibliothèque C de cryptage/décryptage
ja_jp: 6.このアプリは、暗号化/復号化Cライブラリを自己調査しているUWP独自のAPIを呼び出します
zh_hant: 6.此應用調用UWP自帶API，正在自研加密/解密C++庫

# textblock28.Text
source: 7. Bulk encrypted files will be discharged in the original folder order hierarchy, but the saved folder will be saved as the first layer by default
de: 6. Diese App ruft die eigene API der UWP auf, die die Verschlüsselung/Entschlüsselung der C-Bibliothek selbst recherchiert ...
fr: 7. Les fichiers chiffrés en vrac seront déchargés dans la hiérarchie d'ordre de dossier d'origine, mais le dossier enregistré sera enregistré comme la première couche par défaut
ja_jp: 7. 一括暗号化されたファイルは元のフォルダ順序階層で排出されますが、保存されたフォルダはデフォルトで最初のレイヤーとして保存されます。
zh_hant: 7.大量加密後的檔將會按照原資料夾順序層次排放，但是會把保存到的資料夾預設作為第一層存放

# textblock29.Text
source: MD5 and hash algorithms and contrasting text
de: 6. Diese App ruft UWP eigene API, ist Selbststudium Verschlüsselung / Entschlüsselung von C-Bibliothek 7. Bulk-verschlüsselte Dateien werden in der ursprünglichen Ordner-Reihenfolge Hierarchie freigegeben werden, aber wird den Ordner Standard als die erste Schicht von Speicher MD5 und Hash-Algorithmus und Kontrast-Text speichern
fr: Algorithmes MD5 et hachage et texte contrasté
ja_jp: MD5ハッシュアルゴリズムと対照的なテキスト
zh_hant: MD5和雜湊演算法以及對比文本

# textblock3.Text
source: Or
de: Verschlüsselungs-/Entschlüsselungsschlüssel: Die Verwendung der Standardschlüsselverschlüsselung macht die Eingabe des Schlüssels nicht mehr selbst erforderlich, verringert jedoch die Sicherheit. Um zu verhindern, dass Dateien von anderen Apps böswillig entschlüsselt werden, wird der Standardschlüssel dieses Mal nicht mehr explizit angezeigt. Zuvor, aufgrund unserer Fahrlässigkeit, bedauern wir, dass wir die böswillige Verwendung des Standard-Schlüsselangriffs durch einen Techniker nicht berücksichtigt haben. Die Anzahl der für jeden Verschlüsselungsalgorithmus erforderlichen Ziffern ist angegeben, und im Allgemeinen ist die Division der Anzahl der Ziffern durch 8 die Länge des Zeichens, das Sie eingeben möchten (wir garantieren nicht die Folgen des Chinesischen) zum Beispiel: 56 Bits werden mit 7 Zahlen oder Buchstaben eingegeben (z. B. 123F56A) (um genau zu sein hexadezimal, F nach dem Buchstaben so weit wie möglich nicht verlieren). Wenn mehr oder weniger als eine bestimmte Anzahl von Schlüsseln erkannt wird, wird die App von hinten abgeschnitten oder verwendet leere Zeichen, um sie zu ergänzen.
fr: Clés de chiffrement/décryptage : l'utilisation du chiffrement de clé par défaut élimine la nécessité d'entrer la clé vous-même, mais réduit une certaine sécurité. Pour éviter que les fichiers ne soient décryptés de manière malveillante par d'autres applications, la clé par défaut n'est plus explicitement affichée cette fois. Auparavant, en raison de notre négligence, nous sommes désolés de ne pas avoir pris en compte l'utilisation malveillante de l'attaque clé par défaut par un technicien. Le nombre de chiffres requis pour chaque algorithme de cryptage est donné, et en général diviser le nombre de chiffres par 8 est la longueur du personnage que vous voulez entrer (nous ne garantissons pas les conséquences du chinois) par exemple: 56 bits seront entrés avec 7 numéros ou lettres (par exemple: 123F56A) (pour être exactement hexadecimal, F après la lettre dans la mesure du possible ne perdez pas). Si plus ou moins d'un nombre donné de touches est détectée, l'application tronque à l'arrière ou utilise des caractères vides pour les compléter.
ja_jp: 暗号化/復号化キー: 既定のキー暗号化を使用すると、キーを自分で入力する必要がなくなりますが、セキュリティが低下します。 ファイルが他のアプリによって悪意を持って復号化されないように、既定のキーは今度は明示的に表示されなくなります。 以前は、当社の過失により、技術者によるデフォルトのキー攻撃の悪意のある使用を考慮しなかったことを残念に思います。 各暗号化アルゴリズムに必要な桁数が与えられ、一般的に数字を8で割ると、入力する文字の長さ(中国語の結果を保証しません):56ビットは7つの数字または文字(例えば:123F56A)で入力されます(正確にはヘキサデフィマル、 Fは、可能な限り失うことはありません文字の後に)。 特定の数のキーが検出された場合、アプリは背面から切り捨てるか、空の文字を使用してキーを補完します。
zh_hant: 加密/解密密匙：使用預設密匙加密可以免去你自己輸入密匙這個步驟，但是會降低一部分安全性。 為了防止檔被其他應用惡意解密，這次不再明文顯示預設密匙。 從前由於我們的疏忽沒有考慮到技術人員惡意使用預設密匙攻擊，深感抱歉。 每一種加密演算法所需要的密匙的位數都會給出，一般情況下將位數除以8就是你要輸入的字元長度（我們不擔保用中文的後果）比如：56位就要輸入7個數字或字母（再比如：123F56A）（準確來說是十六進位數， F以後的字母盡可能不要輸）。 如果檢測到密匙位數多於或少於給定位數，應用會從後向前截斷或使用空字元補齊。

# textblock30.Text
source: Concept: MD5, message-Algorithm 5 (information-summary algorithm 5), to ensure complete and consistent information transmission. It is one of the most widely used algorithms of computers (and translation summary algorithms, hash algorithms), and MD5 has been widely implemented in mainstream programming languages. The operation of data (such as Chinese characters) as another fixed-length value is the basic principle of the hybrid algorithm, which was preceded by MD2, MD3 and MD4. The MD5 algorithm has the following features:
de: Konzept: MD5, Message-Algorithm 5 (Informations-Zusammenfassungsalgorithmus 5), um eine vollständige und konsistente Informationsübertragung zu gewährleisten. Es ist einer der am häufigsten verwendeten Algorithmen von Computern (und Translation Summary-Algorithmen, Hash-Algorithmen), und MD5 wurde weithin in Mainstream-Programmiersprachen implementiert. Die Funktionsweise von Daten (z. B. chinesische Zeichen) als ein weiterer Wert fester Länge ist das Grundprinzip des Hybridalgorithmus, dem MD2, MD3 und MD4 vorausgingen. Der MD5-Algorithmus verfügt über die folgenden Funktionen:
fr: Concept: MD5, message-Algorithme 5 (algorithme de synthèse d'information 5), pour assurer une transmission complète et cohérente de l'information. C'est l'un des algorithmes les plus largement utilisés des ordinateurs (et des algorithmes de résumé de traduction, algorithmes de hachet), et MD5 a été largement mis en œuvre dans les langages de programmation grand public. Le fonctionnement des données (comme les caractères chinois) comme une autre valeur de longueur fixe est le principe de base de l'algorithme hybride, qui a été précédé par MD2, MD3 et MD4. L'algorithme MD5 a les caractéristiques suivantes :
ja_jp: 概念:MD5、メッセージアルゴリズム5(情報要約アルゴリズム5)、完全かつ一貫性のある情報伝達を確保する。 これは、コンピュータの最も広く使用されているアルゴリズムの一つ(および翻訳要約アルゴリズム、ハッシュアルゴリズム)であり、MD5は、主流のプログラミング言語で広く実装されています。 別の固定長値としてのデータ (漢字など) の操作は、MD2、MD3、および MD4 の前に置かれたハイブリッド アルゴリズムの基本原理です。 MD5 アルゴリズムには、次の機能があります。
zh_hant: 概念：MD5即Message-Digest Algorithm 5（信息-摘要算法5），用于确保信息传输完整一致。是计算机广泛使用的杂凑算法之一（又译摘要算法、哈希算法），主流编程语言普遍已有MD5实现。将数据（如汉字）运算为另一固定长度值，是杂凑算法的基础原理，MD5的前身有MD2、MD3和MD4。MD5算法具有以下特点：

# textblock31.Text
source: 1. Compression: any length of data, calculated MD5 value length is fixed.
de: 1. Komprimierung: beliebige Datenlänge, berechnete MD5-Wertlänge ist festgelegt.
fr: 1. Compression : toute longueur de données, longueur de valeur MD5 calculée est fixe.
ja_jp: 1. 圧縮: 任意の長さのデータ、計算された MD5 値の長さが固定されます。
zh_hant: 1.壓縮性：任意長度的資料，算出的MD5值長度都是固定的。

# textblock32.Text
source: 2. Easy to calculate: It is easy to calculate the MD5 value from the original data.
de: Einfach zu berechnen: Es ist einfach, den MD5-Wert aus den Originaldaten zu berechnen.
fr: 2. Facile à calculer : il est facile de calculer la valeur MD5 à partir des données d'origine.
ja_jp: 2.計算が簡単:元のデータからMD5値を計算するのは簡単です。
zh_hant: 2.容易計算：從原資料計算出MD5值很容易。

# textblock33.Text
source: 3. Anti-modification: any changes to the original data, even if only 1 byte, the resulting MD5 value is very different.
de: 3. Anti-Modifikation: Alle Änderungen an den ursprünglichen Daten, auch wenn nur 1 Byte, der resultierende MD5-Wert ist sehr unterschiedlich.
fr: 3. Anti-modification : toute modification des données d'origine, même si seulement 1 octet, la valeur MD5 résultante est très différente.
ja_jp: 3. アンチ修飾: 元のデータに対する変更は、たとえ 1 バイトであっても、結果として得られる MD5 値が大きく異なります。
zh_hant: 3.抗修改性：對原資料進行任何改動，哪怕只修改1個位元組，所得到的MD5值都有很大區別。

# textblock34.Text
source: 4. Strong collision: Known raw data and its MD5 value, it is very difficult to find a data with the same MD5 value (i.e. falsified data).
de: 4. Starke Kollision: Bekannte Rohdaten und ihr MD5-Wert, es ist sehr schwierig, Daten mit dem gleichen MD5-Wert (d. h. gefälschte Daten) zu finden.
fr: 4. Collision forte : Les données brutes connues et leur valeur MD5, il est très difficile de trouver une donnée ayant la même valeur MD5 (c.-à-d. données falsifiées).
ja_jp: 3. アンチ修飾: 元のデータに対する変更は、たとえ 1 バイトであっても、結果として得られる MD5 値が大きく異なります。 ...
zh_hant: 4.強抗碰撞：已知原資料和其MD5值，想找到一個具有相同MD5值的資料（即偽造資料）是非常困難的。

# textblock35.Text
source: The role of MD5 is to make large-capacity information compressed into a confidential format (i.e., converting a string of bytes of any length into a certain length of hexadecimal string) hash algorithm skewed it, before signing a private key with digital signature software. Due to the time constraints did not add the sha3 algorithm, here is a sincere apology to express.
de: Die Rolle von MD5 besteht darin, Informationen mit großer Kapazität in ein vertrauliches Format zu komprimiert (d. h. eine Zeichenfolge von Bytes beliebiger Länge in eine bestimmte Länge der hexadezimalen Zeichenfolge zu konvertieren), die ihn verzerrt hat, bevor ein privater Schlüssel mit digitaler Signatursoftware signiert wird. Aufgrund der Zeitbeschränkungen, die den sha3-Algorithmus nicht hinzugefügt haben, ist hier eine aufrichtige Entschuldigung zum Ausdruck zu bringen.
fr: Le rôle de MD5 est de faire des informations de grande capacité compressées dans un format confidentiel (c.-à-d., la conversion d'une chaîne d'octets de n'importe quelle longueur dans une certaine longueur de chaîne hexadecimal) algorithme de hachages biaisé, avant de signer une clé privée avec un logiciel de signature numérique. En raison des contraintes de temps n'a pas ajouté l'algorithme sha3, voici des excuses sincères à exprimer.
ja_jp: MD5 の役割は、大容量の情報を機密形式に圧縮することです (つまり、任意の長さのバイトの文字列を特定の長さのヘキサデシマル文字列に変換する) ハッシュ アルゴリズムは、デジタル署名ソフトウェアで秘密キーに署名する前に、それを歪めました。 時間の制約のためにsha3アルゴリズムを追加しなかったので、ここでは表現する誠実な謝罪です。
zh_hant: MD5的作用是讓大容量資訊在用數位簽章軟體簽署私人金鑰前被 壓縮 成一種保密的格式（就是把一個任意長度的位元組串變換成一定長的十六進位數位串）雜湊演算法依次類推。 由於時間緊迫沒有添加sha3演算法，在此表達真摯的歉意.

# textblock36.Text
source: Popular explanation: Many download sites will give the file's sha value, only need to compare the downloaded file's sha value is consistent with the given, you can determine whether the file is damaged during the download process
de: Beliebte Erklärung: Viele Download-Sites geben den Sha-Wert der Datei an, müssen nur den Sha-Wert der heruntergeladenen Datei mit dem angegebenen vergleichen, Sie können feststellen, ob die Datei während des Downloadvorgangs beschädigt ist.
fr: Explication populaire: De nombreux sites de téléchargement donnera la valeur sha du fichier, seulement besoin de comparer la valeur du fichier téléchargé sha est compatible avec le donné, vous pouvez déterminer si le fichier est endommagé pendant le processus de téléchargement
ja_jp: 一般的な説明:多くのダウンロードサイトは、ファイルのsha値を与え、ダウンロードされたファイルのsha値を比較するだけで与えられたものと一致し、ダウンロードプロセス中にファイルが破損しているかどうかを判断することができます
zh_hant: 通俗解釋：許多下載站會給出檔的sha值，只需要對比下載到的檔的sha值是否和給出的一致，就可以判斷檔是否在下載過程中被損壞

# textblock37.Text
source: Comparison files: Temporarily remove this feature due to low usage frequency and time issues
de: Vergleichsdateien: Entfernen Sie diese Funktion vorübergehend aufgrund von geringer Nutzungshäufigkeit und Zeitproblemen
fr: Fichiers de comparaison : supprimez temporairement cette fonctionnalité en raison de la faible fréquence d'utilisation et des problèmes de temps
ja_jp: 比較ファイル: 使用頻度と時間の問題が原因で、この機能を一時的に削除します。
zh_hant: 對比檔：出於過低的使用頻率和時間問題，暫時移除這一功能

# textblock38.Text
source: About old format files
de: Informationen zu Dateien mit altem Format
fr: À propos des fichiers de format anciens
ja_jp: 关于旧格式文件
zh_hant: 關於舊格式檔
