Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/MultilingualResources/zhushou_jiami_jiemi.*.xlf
Languages: de, fr, ja_jp, zh_hant

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Fehler bei der Auswahl der Datei<
fr: Il y a eu une erreur de sélection du fichier<
ja_jp: ファイルの選択中にエラーが発生しました<
zh_hant: 選擇檔時發生錯誤<

# String2
source: Paste successful
de: Fehler bei der Auswahl eines Ordners<
fr: 选Il y avait une erreur de choisir un dossier<
ja_jp: フォルダの選択中にエラーが発生しました<
zh_hant: 選擇資料夾時發生錯誤<

# textblock1.Text
source: Enter text
de: Hinzufügen einer Datei oder eines Ordners zum Entschlüsseln
fr: Ajouter un fichier ou un dossier pour déchiffrer
ja_jp: 復号化するファイルまたはフォルダを追加する
zh_hant: 添加要解密的檔或資料夾

# textblock2.Text
source: Decrypting results
de: Ziehen Sie eine Datei oder einen Ordner über die Seite, um sie zu verschlüsseln
fr: Faites glisser un fichier ou un dossier sur la page pour le chiffrer
ja_jp: ファイルまたはフォルダをページ上でドラッグして暗号化する
zh_hant: 將檔或資料夾拖拽到整個頁面內即可加密

# textblock3.Text
source: Or
de: Und entweder
fr: Et soit
ja_jp: または
zh_hant: 新增任一個

# textblock4.Text
source: Time remaining:
de: Datei hinzufügen
fr: Ajouter un fichier
ja_jp: ファイルを追加
zh_hant: 新增檔案

# textblock5.Text
source: Add a Folder
de: Ordner hinzufügen
fr: Ajouter des dossiers
ja_jp: フォルダーの追加
zh_hant: 新增資料夾

# textblock1.Text
source: Enter text
de: Einige Dateien konnten nicht erfolgreich entschlüsselt werden
fr: Certains fichiers n'ont pas pu être décryptés avec succès
ja_jp: 一部のファイルを正常に復号化できませんでした
zh_hant: 部分檔未能成功解密

# textblock16.Text
source: Next
de: Fertig
fr: Terminé
ja_jp: 完了
zh_hant: 完成

# textblock2.Text
source: Decrypting results
de: Dateien insgesamt
fr: Total de fichiers
ja_jp: Total Files
zh_hant: 檔案總數

# textblock4.Text
source: Time remaining:
de: Anzahl der Dateien, die nicht entschlüsselt werden konnten：
fr: Nombre de fichiers qui n'ont pas pu être décryptés：
ja_jp: 復号化できなかったファイルの数：
zh_hant: 無法解密的檔數量：

# textblock6.Text
source: Speed
de: Verstrichene Zeit:
fr: Temps écoulé :
ja_jp: 経過時間:
zh_hant: 花費的時間

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Ziehen und Ablegen hier, um Dateien hinzuzufügen o(^▽^)o
fr: Faites glisser et déposer ici pour ajouter des fichiers o(^▽^)o
ja_jp: ここにドラッグ アンド ドロップしてファイルを追加する o(^▽^)o
zh_hant: 拖放此處即可添加檔 o(^▽^)o

# textblock1.Text
source: Enter text
de: Hinzufügen einer zu verschlüsselnden Datei oder eines Ordners
fr: Ajouter un fichier ou un dossier pour chiffrer
ja_jp: 暗号化するファイルまたはフォルダを追加する
zh_hant: 添加要加密的檔或資料夾

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Fertig
fr: Terminé
ja_jp: 完了
zh_hant: 完成

# textblock1.Text
source: Enter text
de: Einige Dateien wurden nicht erfolgreich verschlüsselt
fr: Certains fichiers n'ont pas été chiffrés avec succès
ja_jp: 一部のファイルは正常に暗号化されませんでした
zh_hant: 部分檔未能成功加密

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Sie haben keine Dateien oder Ordner hinzugefügt
fr: Vous n'avez pas ajouté de fichiers ou de dossiers
ja_jp: ファイルやフォルダを追加しなかった
zh_hant: 你沒有添加任何一個檔或資料夾

# String4
source: Please set the password before encrypting
de: Sie haben keine Dateien hinzugefügt und konnten keine leeren Ordner verschlüsseln
fr: Vous n'avez pas ajouté de fichiers，Les dossiers vides ne peuvent pas être cryptés
ja_jp: ファイルを追加しなかったし、空のフォルダを暗号化できませんでした
zh_hant: 你沒有添加任何一個檔，無法加密空的資料夾

# textblock1.Text
source: Enter text
de: Vergewissern Sie sich, dass eine Datei oder ein Ordner, der kurz vor der Verschlüsselung steht,
fr: Confirmer qu'un fichier ou un dossier qui est sur le point d'être crypté
ja_jp: 暗号化しようとしているファイルまたはフォルダを確認する
zh_hant: 你沒有添加任何一個檔，無法加密空的資料夾 ...

# textblock11.Text
source: Add File
de: Datei hinzufügen
fr: Ajouter un fichier
ja_jp: ファイルを追加
zh_hant: 新增檔案

# textblock13.Text
source: Add a Folder
de: Ordner hinzufügen
fr: Ajouter des dossiers
ja_jp: フォルダーの追加
zh_hant: 新增資料夾

# textblock15.Text
source: New Task
de: Zurück zum übergeordneten Ordner
fr: Retour au dossier parent
ja_jp: 親フォルダに戻る
zh_hant: 返回上級資料夾

# textblock20.Text
source: Previous
de: Zurück
fr: Étape précédente
ja_jp: 前のステップ
zh_hant: 之前的

# textblock16.Text
source: Next
de: Nächster Schritt
fr: Étape suivante
ja_jp: 次のステップ
zh_hant: 下一步

# biaoti2.Text
source: Welcome
de: willkommen
fr: accueillir
ja_jp: ようこそ
zh_hant: 歡迎

# biaoti6.Text
source: Encoding
de: Verschlüsselung
fr: chiffrement
ja_jp: 暗号化
zh_hant: 加密

# biaoti7.Text
source: Decrypt
de: entschlüsseln
fr: déchiffrer
ja_jp: 解読する
zh_hant: 解密

# shengcheng_jia.Content
source: Build
de: Generation
fr: Génération
ja_jp: 生成
zh_hant: 產生

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: zurücksetzen
fr: réinitialiser
ja_jp: リセットする
zh_hant: 重設

# String2
source: Paste successful
de: Dieser Text kann nicht verschlüsselt werden, versuchen Sie es erneut
fr: Ce texte ne peut pas être crypté, s'il vous plaît essayer à nouveau
ja_jp: このテキストは暗号化できません。
zh_hant: 無法加密這個文本，請重試

# String3
source: Click < 使用 > 按钮以确认密码无误
de: zurücksetzen
fr: réinitialiser
ja_jp: リセットする
zh_hant: 重設

# String4
source: Please set the password before encrypting
de: zurücksetzen
fr: réinitialiser
ja_jp: リセットする
zh_hant: 重設

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Der eingegebene Text passt nicht zum neuen Format, und um den alten Text zu entschlüsseln, besuchen Sie Archiv
fr: Le texte que vous avez entré ne correspond pas au nouveau format, et pour déchiffrer l'ancien texte, visitez Archive
ja_jp: 入力したテキストが新しい形式に適合せず、古いテキストを復号化するには、[アーカイブ] にアクセスします。
zh_hant: 你輸入的文本不符合新版格式，若要解密舊版文本，請訪問存檔

# String6
source: This text cannot be decrypted, make sure the decryption key and algorithm are correct
de: Dieser Text kann nicht entschlüsselt werden, stellen Sie sicher, dass der Entschlüsselungsschlüssel und der Algorithmus korrekt sind
fr: Ce texte ne peut pas être décrypté, assurez-vous que la clé de déchiffrement et l'algorithme sont corrects
ja_jp: このテキストは復号化できません。
zh_hant: 無法解密此文本，請確保解密密匙和演算法正確

# String7
source: Password error, please confirm and try again
de: Kennwortfehler, bestätigen Sie und versuchen Sie es erneut
fr: Erreur de mot de passe, s'il vous plaît confirmer et essayer à nouveau
ja_jp: パスワードエラー、確認してもう一度やり直してください
zh_hant: 密碼錯誤，請確認後重試

# String8
source: Replication successful
de: zurücksetzen
fr: réinitialiser
ja_jp: リセットする
zh_hant: 重設

# textblock14.Text
source: Need help?
de: Benötigen Sie Hilfe?
fr: Besoin d'aide ?
ja_jp: ヘルプが必要ですか?
zh_hant: 需要協助嗎?

# textblock2.Text
source: Decrypting results
de: Benötigen Sie Hilfe?
fr: Besoin d'aide ?
ja_jp: ヘルプが必要ですか?
zh_hant: 需要協助嗎?

# textblock3.Text
source: Or
de: Was gibt es Neues - Download Management
fr: Quoi de neuf - Télécharger La gestion
ja_jp: 新機能 - ダウンロード管理
zh_hant: 新增功能 —— 下載管理

# textlock4.Text
source: Key
de: schlüssel
fr: clé
ja_jp: キー
zh_hant: 密匙

# textlock5.Text
source: Automatic
de: automatisch
fr: automatique
ja_jp: 自動
zh_hant: 自動

# textlock9.Text
source: Algorithm
de: Algorithmus
fr: algorithme
ja_jp: アルゴリズム
zh_hant: 演算法

# textblock15.Text
source: New Task
de: Erstellt eine neue Aufgabe
fr: Crée une tâche
ja_jp: 新しいタスクを作成します
zh_hant: 建立新任務

# fangshi.Header
source: Download As:
de: Download als:
fr: Télécharger comme :
ja_jp: ダウンロード方法:
zh_hant: 下載成為:

# fangshi_1
source: Http single-threaded non-point break
de: Http Single-Threaded Nicht-Punkt-Unterbrechung
fr: HttpContinuité non intermittente à fil unique
ja_jp: Httpシングルスレッド非断続的な連続性
zh_hant: Http單線程非中斷點續傳

# fangshi_2
source: Http single-threaded break-in
fr: HttpCambriolage à fil unique
ja_jp: Httpシングルスレッドブレークイン
zh_hant: Http單線程中斷點續傳

# queding.Content
source: OK
zh_hant: 確定

# quexiao.Content
source: Cancel
de: abbrechen
fr: annuler
ja_jp: 取り消す
zh_hant: 關閉

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Fehler bei der Auswahl eines Ordners<
fr: Il y a eu une erreur de sélection d'un dossier<
ja_jp: フォルダの選択中にエラーが発生しました<
zh_hant: 選擇資料夾時發生錯誤<

# String2
source: Paste successful
de: Bitte wählen Sie aus, wie Sie herunterladen möchten
fr: S'il vous plaît choisir comment télécharger
ja_jp: ダウンロード方法を選択してください
zh_hant: 請選擇下載方式

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Bitte geben Sie die Download-Adresse ein
fr: S'il vous plaît entrer l'adresse de téléchargement
ja_jp: ダウンロードアドレスを入力してください
zh_hant: 請輸入下載位址

# String4
source: Please set the password before encrypting
de: Bitte wählen Sie den Ordner aus, in dem Sie
fr: Veuillez sélectionner le dossier dans lequel vous avez enregistré
ja_jp: 保存したフォルダを選択してください
zh_hant: 請選擇保存到的資料夾

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Dieser Download kann nur in der Bildbibliothek gespeichert werden
fr: Ce téléchargement ne peut être enregistré que dans la bibliothèque d'images
ja_jp: このダウンロードは、画像ライブラリにのみ保存できます。
zh_hant: 此下載方式只能保存到圖片庫

# textblock1.Text
source: Enter text
de: Neue Download-Aufgabe
fr: Nouvelle tâche de téléchargement
ja_jp: 新しいダウンロード タスク
zh_hant: 新建下載任務

# textblock5.Text
source: Add a Folder
de: durchsuchen
fr: parcourir
ja_jp: 閲覧する
zh_hant: 瀏覽

# textbox2.Text
source: Save to
de: Gespeichert in
fr: Enregistré dans
ja_jp: 保存先
zh_hant: 已儲存至

# fangshi.PlaceholderText
source: Select a download mode
de: Wählen sie eine art download
fr: Choisissez un mode de téléchargement
ja_jp: ダウンロード方法を選択します
zh_hant: 選擇一個下載方式

# biaoti2.Text
source: Welcome
de: Datei herunterladen
fr: Télécharger le fichier
ja_jp: ファイルをダウンロードする
zh_hant: 下載檔案

# wangcehng.Text
source: Completed
de: Abgeschlossen
fr: Terminés
ja_jp: 完了済み
zh_hant: 已履行

# zhengzai.Text
source: Downloading
de: heruntergeladen
fr: Téléchargement en cours
ja_jp: ダウンロード中
zh_hant: 下載進行中

# biaoti1.Text
source: 欢
de: M
fr: M
ja_jp: M
zh_hant: M

# biaoti2.Text
source: Welcome
de: D5 prüfen
fr: D5 vérifier
ja_jp: D5チェック
zh_hant: D5校驗

# wenben.Text
source: Text
fr: Texte
ja_jp: テキスト
zh_hant: 文字

# wenjian.Text
source: File
de: Datei
fr: fichier
ja_jp: ファイル
zh_hant: 檔案

# String2
source: Paste successful
de: klicken < 使用 > 按钮以确认密码无误
fr: claquer < 使用 > 按钮以确认密码无误
ja_jp: 请单击 < 使用 > 按钮以确认密码无误
zh_hant: 請按一下 < 使用 > 按钮以确认密码无误

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Bitte legen Sie das Kennwort vor der Verschlüsselung fest.
fr: S'il vous plaît définir le mot de passe avant de chiffrer
ja_jp: 暗号化する前にパスワードを設定してください
zh_hant: 請先設置密碼,再進行加密

# textblock1.Text
source: Enter text
de: Füllen Sie die Parameter aus, die auf die Datei angewendet werden.
fr: Remplissez les paramètres qui seront appliqués au fichier
ja_jp: ファイルに適用されるパラメータを入力します。
zh_hant: 填寫將應用於檔的參數

# textblock15.Text
source: New Task
de: Erweitert
fr: Avancé
ja_jp: 詳細
zh_hant: 進階

# textmcc.Text
source: Use the default encryption/decryption key (recommended)
de: Prompt-Datei wird verschlüsselt
fr: Le fichier rapide est crypté
ja_jp: プロンプト ファイルが暗号化されている
zh_hant: 提示檔被加密

# textmcc1.Text
source: Record encryption algorithms and keys
de: Aufzeichnen von Verschlüsselungsalgorithmen und Schlüsseln
fr: Enregistrer les algorithmes et les clés de chiffrement
ja_jp: 暗号化アルゴリズムとキーの記録
zh_hant: 記錄加密演算法和密匙

# textmcc2.Text
source: Dual encryption
de: Duale Verschlüsselung
fr: Double cryptage
ja_jp: デュアル暗号化
zh_hant: 雙重加密

# textmcc3.Text
source: Delete the original file after success
de: Löschen der Originaldatei nach Erfolg
fr: Supprimer le fichier d'origine après le succès
ja_jp: 成功後に元のファイルを削除する
zh_hant: 成功後刪除原檔

# textblock1.Text
source: Enter text
de: Verschlüsselung erfolgreich
fr: Chiffrement réussi
ja_jp: 暗号化に成功しました
zh_hant: 加密成功

# textblock2.Text
source: Decrypting results
de: Gesamtzahl der verschlüsselten Dateien：
fr: Nombre total de fichiers chiffrés：
ja_jp: 暗号化されたファイルの総数：
zh_hant: 加密檔總數：

# textblock4.Text
source: Time remaining:
de: Gesamtgröße der verschlüsselten Dateien：
fr: Taille totale des fichiers cryptés：
ja_jp: 暗号化されたファイルの合計サイズ：
zh_hant: 加密檔總共大小：

# textblock8.Text
source: percent complete
de: Durchschnittliche Velocity
fr: Vélocité moyenne
ja_jp: 平均ベロシティ
zh_hant: 平均速度

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Wählen Sie einen Ordner aus, um die Verschlüsselungsergebnisse zu speichern.
fr: S'il vous plaît sélectionnez un dossier pour enregistrer les résultats de cryptage
ja_jp: 暗号化結果を保存するフォルダを選択してください
zh_hant: 請選擇一個資料夾以保存加密結果

# textblock1.Text
source: Enter text
de: Wählen Sie einen Speicherpfad
fr: Sélectionnez un chemin d'enregistrement
ja_jp: 保存パスの選択
zh_hant: 選擇保存路徑

# textblock3.Text
source: Or
de: Save-Pfad：
fr: Enregistrer le chemin：
ja_jp: パスの保存：
zh_hant: 保存路徑：

# textblock10.Text
source: DES (Data Standard Encryption): Symmetry algorithm, data encryption standard, faster, suitable for encrypting large amounts of data;
de: Zuletzt aktualisiert: 2020/2/4 20:35
fr: Dernière mise à jour: 2020/2/20 20:35
ja_jp: 最終更新日: 2020/2/4 20:35
zh_hant: 最後更新日期: 2020/2/4 20:35

# textblock11.Text
source: Add File
de: Entwickler: Little Fish 团队
fr: Développeurs: Little Fish 团队
ja_jp: 開発者: Little Fish 团队
zh_hant: 開發者: Little Fish 团队

# textblock12.Text
source: RC2 and RC4: Symmetry algorithm, which encrypts large amounts of data with a long key, faster than DES;
de: Unsere E-Mail：
fr: Notre e-mail：
ja_jp: 私たちの電子メール：
zh_hant: 我們的電子郵箱：

# textblock14.Text
source: Need help?
de: KundeQQ: 3101558049
fr: individuQQ: 3101558049
ja_jp: 顧客QQ: 3101558049
zh_hant: 客服QQ: 3101558049

# textblock15.Text
source: New Task
de: Besprechen Sie die QQ-Gruppe: 564467848
fr: discuterQQ群: 564467848
ja_jp: 讨论QQ群: 564467848
zh_hant: 讨论QQ群: 564467848

# textblock16.Text
source: Next
de: Nutzungsbedingungen für die Anwendung：
fr: Conditions d'utilisation pour la demande：
ja_jp: 申込み利用規約：
zh_hant: 應用服務條款：

# textblock9.Text
source: Popular explanation: It's like putting your file in a drawer and locking it, only with the corresponding key to open it (decrypted), and no one else can open it unless it's violent (try ingestalling all the keys in the world)
de: App-Versionsnummer: 1.5.37.0
fr: Numéro de version de l'application: 1.5.37.0
ja_jp: アプリのバージョン番号: 1.5.37.0
zh_hant: 應用版本號: 1.5.37.0

# jisuan.Content
source: Counting
de: berechnung
fr: calcul
ja_jp: 計算
zh_hant: 记 算

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Fehler in der Nachrichtenzusammenfassung der Datei（
fr: Il y a eu une erreur dans le résumé du message du fichier（
ja_jp: ファイルのメッセージの要約にエラーが発生しました（
zh_hant: 對檔進行消息摘要時發生錯誤（

# String2
source: Paste successful
de: ）.Wenn diese Meldung nach dem erneuten Versuch immer noch angezeigt wird, fragen Sie bitte im Feedback Center nach, und wir werden das Problem so schnell wie möglich untersuchen und beheben.
fr: ）.Si ce message apparaît toujours après avoir réessayé plus d'une fois, s'il vous plaît demander dans le centre de rétroaction et nous allons enquêter et résoudre le problème dès que possible
ja_jp: ）.このメッセージが複数回再試行した後も表示される場合は、フィードバックセンターに問い合わせ、できるだけ早く問題を調査して解決します。
zh_hant: ）.若重試多次後仍然出現這條消息，請在回饋中樞提出，我們會儘快調查並解決問題

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Paste erfolgreich
fr: Pâte réussie
ja_jp: 貼り付けに成功しました
zh_hant: 粘貼成功

# textblock1.Text
source: Enter text
de: Text eingeben
fr: Entrer du texte
ja_jp: テキストの入力
zh_hant: 輸入文字

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Algorithmus
fr: algorithme
ja_jp: アルゴリズム
zh_hant: 演算法

# wen_suan.Text
source: Select the algorithm
de: Wählen Sie den Algorithmus
fr: Sélectionnez l'algorithme
ja_jp: アルゴリズムを選択する
zh_hant: 選擇演算法

# guanyu.Content
source: Help
de: Hilfe
fr: aide
ja_jp: ヘルプ
zh_hant: 說明

# home.Content
source: Home
de: Startseite
fr: Accueil
ja_jp: ホーム
zh_hant: 首頁

# jiami.Content
source: Encrypting text or files
de: Verschlüsseln von Text oder Dateien
fr: Chiffrer le texte ou les fichiers
ja_jp: テキストまたはファイルの暗号化
zh_hant: 加密文本或檔

# jiemi.Content
source: Decrypt text or files
de: Entschlüsseln von Text oder Dateien
fr: Décrypter le texte ou les fichiers
ja_jp: テキストまたはファイルの暗号化を解除する
zh_hant: 解密文本或檔

# md5_haxi.Content
source: MD5 and hash functions
de: MD5- und Hashfunktionen
fr: MD5et les fonctions de hâh
ja_jp: MD5およびハッシュ関数
zh_hant: MD5和雜湊函數

# xiazai.Content
source: Download management
fr: Gestion des téléchargements
ja_jp: ダウンロード管理
zh_hant: 下載管理

# biaoti1.Text
source: 欢
ja_jp: 解く
zh_hant: 解

# biaoti2.Text
source: Welcome
de: verschlüsselung
fr: cryptage
ja_jp: 暗号化
zh_hant: 密

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Fehler beim Entschlüsseln der Datei
fr: Défaut de déchiffrer le fichier
ja_jp: ファイルの復号化に失敗しました
zh_hant: 解密檔失敗

# textblock1.Text
source: Enter text
de: Entschlüsseln der Datei
fr: Décryptage du fichier
ja_jp: ファイルの復号化
zh_hant: 正在解密檔

# textblock2.Text
source: Decrypting results
de: Verstrichene Zeit:
fr: Temps écoulé :
ja_jp: 経過時間:
zh_hant: 花費的時間

# textblock4.Text
source: Time remaining:
de: Verbleibende Zeit:
fr: Temps restant :
ja_jp: 残り時間:
zh_hant: 剩餘:

# textblock6.Text
source: Speed
de: Geschwindigkeit
fr: Vitesse
ja_jp: 速度
zh_hant: 速度

# textblock8.Text
source: percent complete
de: Prozent abgeschlossen
fr: % achevé
ja_jp: 達成率
zh_hant: 完成百分比

# jiami_wen_an.Text
source: Decrypt
de: entschlüsseln
fr: déchiffrer
ja_jp: 解読する
zh_hant: 解密

# String2
source: Paste successful
de: Paste erfolgreich
fr: Pâte réussie
ja_jp: 貼り付けに成功しました
zh_hant: 粘貼成功

# String3
source: Click < 使用 > 按钮以确认密码无误
de: klicken < 使用 > 按钮以确认密码无误
fr: claquer < 使用 > 按钮以确认密码无误
ja_jp: 请单击 < 使用 > 按钮以确认密码无误
zh_hant: 請按一下 < 使用 > 按钮以确认密码无误

# String4
source: Please set the password before encrypting
de: Bitte legen Sie das Kennwort vor der Verschlüsselung fest.
fr: S'il vous plaît définir le mot de passe avant de chiffrer
ja_jp: 暗号化する前にパスワードを設定してください
zh_hant: 請先設置密碼,再進行加密

# String8
source: Replication successful
de: Replikation erfolgreich
fr: Réplication réussie
ja_jp: レプリケーションに成功しました
zh_hant: 複製成功

# textblock2.Text
source: Decrypting results
de: Entschlüsseln von Ergebnissen
fr: Décryptage des résultats
ja_jp: 結果の復号化
zh_hant: 解密結果

# textblock19.Text
source: Previous
de: Zurück
fr: Étape précédente
ja_jp: 前のステップ
zh_hant: 之前的

# textblock1.Text
source: Enter text
de: Erfolgreich entschlüsseln
fr: Décryptage réussi
ja_jp: 復号化が正常に行きませんでした
zh_hant: 解密成功

# textblock2.Text
source: Decrypting results
de: Gesamtzahl der entschlüsselten Dateien：
fr: Nombre total de fichiers décryptés：
ja_jp: 復号化されたファイルの総数：
zh_hant: 解密檔總數：

# textblock4.Text
source: Time remaining:
de: Gesamtgröße der entschlüsselten Datei：
fr: Taille totale du fichier décrypté：
ja_jp: 復号化されたファイルの合計サイズ：
zh_hant: 解密檔總共大小：

# biaoti1.Text
source: 欢
zh_hant: 加

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Fehler beim Verschlüsseln der Datei
fr: Échec du chiffrement du fichier
ja_jp: ファイルの暗号化に失敗しました
zh_hant: 加密檔失敗

# String2
source: Paste successful
de: Fehler beim Verschlüsseln der Datei
fr: Échec du chiffrement du fichier
ja_jp: ファイルの暗号化に失敗しました
zh_hant: 加密檔失敗

# textblock1.Text
source: Enter text
de: Verschlüsseln der Datei
fr: Chiffrement du fichier
ja_jp: ファイルの暗号化
zh_hant: 正在加密檔

# jiami_wen_an.Text
source: Decrypt
de: Verschlüsselung
fr: chiffrement
ja_jp: 暗号化
zh_hant: 加密

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Dieser Text kann nicht verschlüsselt werden, versuchen Sie es erneut
fr: Ce texte ne peut pas être crypté, s'il vous plaît essayer à nouveau
ja_jp: このテキストは暗号化できません。
zh_hant: 無法加密這個文本，請重試

# String6
source: This text cannot be decrypted, make sure the decryption key and algorithm are correct
de: Replikation erfolgreich
fr: Réplication réussie
ja_jp: レプリケーションに成功しました
zh_hant: 複製成功

# textblock2.Text
source: Decrypting results
de: Verschlüsselungsergebnisse
fr: Résultats de chiffrement
ja_jp: 暗号化結果
zh_hant: 加密結果

# wen_suan.Text
source: Select the algorithm
de: Algorithmus
fr: algorithme
ja_jp: アルゴリズム
zh_hant: 演算法

# textblock1.Text
source: Enter text
de: schlüssel
fr: clé
ja_jp: キー
zh_hant: 密匙

# textblock10.Text
source: DES (Data Standard Encryption): Symmetry algorithm, data encryption standard, faster, suitable for encrypting large amounts of data;
de: DES (Data Standard Encryption): Symmetriealgorithmus, Datenverschlüsselungsstandard, schneller, geeignet für die Verschlüsselung großer Datenmengen;
fr: DES (Data Standard Encryption): algorithme de symétrie, norme de cryptage des données, plus rapide, adapté pour le cryptage de grandes quantités de données;
ja_jp: DES (データ標準暗号化): 対称アルゴリズム、データ暗号化標準、高速化、大量のデータの暗号化に適しています。
zh_hant: DES（Data Encryption Standard）：對稱演算法，資料加密標準，速度較快，適用于加密大量資料的場合；

# textblock11.Text
source: Add File
de: 3DES (Triple DES): Ein symmetrischer Algorithmus, der auf DES basiert und ein Datenstück dreimal mit drei verschiedenen Schlüsseln verschlüsselt, mit einer höheren Intensität;
fr: 3DES (Triple DES) : Algorithme symétrique basé sur DES, qui crypte un morceau de données trois fois avec trois touches différentes, avec une intensité plus élevée ;
ja_jp: 3DES (トリプル DES): DES に基づく対称アルゴリズムで、3 つの異なるキーでデータを 3 回暗号化し、より高い強度を持つ。
zh_hant: 3DES（Triple DES）：是基於DES的對稱演算法，對一塊資料用三個不同的金鑰進行三次加密，強度更高；

# textblock12.Text
source: RC2 and RC4: Symmetry algorithm, which encrypts large amounts of data with a long key, faster than DES;
de: RC2 und RC4: Symmetriealgorithmus, der große Datenmengen mit einem langen Schlüssel verschlüsselt, schneller als DES;
fr: RC2 et RC4: Algorithme de symétrie, qui crypte de grandes quantités de données avec une longue clé, plus rapide que DES;
ja_jp: RC2 と RC4: 対称アルゴリズムは、DES よりも高速な長いキーで大量のデータを暗号化します。
zh_hant: RC2和RC4：對稱演算法，用變長金鑰組大量資料進行加密，比 DES 快；

# textblock13.Text
source: Add a Folder
de: Erweiterte Verschlüsselung: Erweiterter Verschlüsselungsstandard, symmetrischer Algorithmus, ist die nächste Generation von Verschlüsselungsalgorithmus Standard, schnell, hohe Sicherheitsstufe, in der 21. Jahrhundert AES-Standard eine Implementierung ist der Rijndael-Algorithmus;
fr: Chiffrement avancé : La norme de chiffrement avancée, algorithme symétrique, est la prochaine génération d'algorithme de cryptage standard, rapide, niveau de sécurité élevé, dans le 21ème siècle AES standard une implémentation est l'algorithme Rijndael;
ja_jp: AES（Advanced Encryption Standard）：高级加密标准，对称算法，是下一代的加密算法标准，速度快，安全级别高，在21世纪AES 标准的一个实现是 Rijndael 算法；
zh_hant: AES（Advanced Encryption Standard）：進階加密標準，對稱演算法，是下一代的加密演算法標準，速度快，安全級別高，在21世紀AES 標準的一個實現是 Rijndael 演算法；

# textblock14.Text
source: Need help?
de: Hinweis: Es wird empfohlen, AES 192 Bits für die Verschlüsselung zu verwenden, die sicher und effizient ist. Aufgrund technischer Einschränkungen bei der vollständigen Nutzung des elektronischen Verschlüsselungsbuchs (ECB), die die Sicherheitsleistung beeinträchtigen können, werden vertrauliche Dateien mit der Verschlüsselungssoftware von Win32 verwendet. Bleiben Sie dran für Follow-up-Updates。
fr: Remarque : Il est recommandé d'utiliser 192 bits AES pour le chiffrement, qui est sûr et efficace. En raison des restrictions techniques sur l'utilisation complète du mode Electronic Cipher Book (ECB), qui peut dégrader les performances de sécurité, des fichiers confidentiels sont utilisés à l'aide du logiciel de cryptage de Win32. Restez à l'écoute pour les mises à jour de suivi.
ja_jp: 注: 安全で効率的な暗号化には AES 192 ビットを使用することをお勧めします。 セキュリティパフォーマンスを低下させる可能性のある電子暗号ブック (ECB) モードの完全な使用に技術的な制限があるため、機密ファイルは Win32 の暗号化ソフトウェアを使用して使用されます。 フォローアップの更新にご期待ください。
zh_hant: 注意：推薦使用AES 192位進行加密，安全高效。 由於技術限制全部使用電子密碼本（ECB）模式，可能會降低安全性能，機密檔請使用Win32的加密軟體。 敬請期待後續更新。

# textblock15.Text
source: New Task
de: Kennwort
fr: mot de passe
ja_jp: パスワード
zh_hant: 密碼
