Repository: LittleFish-233/EncryptionAssistant
Catalog: EncryptionAssistant/MultilingualResources/zhushou_jiami_jiemi.*.xlf
Languages: de, fr, ja_jp, zh_hant

# textblock39.Text
source: Due to Microsoft's aggressive update policy and limited effort on the part of the development team, it is no longer possible to compile the 1.3.711 code project or run the 1.3.6 local installation package. But we built 1.3.711 version of the encryption/decryption page in the app How to access it: Help Center - archive
de: Aufgrund der aggressiven Update-Richtlinie von Microsoft und des begrenzten Aufwands seitens des Entwicklungsteams ist es nicht mehr möglich, das Codeprojekt 1.3.711 zu kompilieren oder das lokale Installationspaket 1.3.6 auszuführen. Aber wir haben 1.3.711 Version der Verschlüsselung / Entschlüsselungsseite in der App Wie man darauf zugreift: Help Center - Archiv
fr: En raison de la politique de mise à jour agressive de Microsoft et de l'effort limité de l'équipe de développement, il n'est plus possible de compiler le projet de code 1.3.711 ou d'exécuter le package d'installation locale 1.3.6. Mais nous avons construit 1.3.711 version de la page de cryptage / décryptage dans l'application Comment y accéder: Centre d'aide - archive
ja_jp: マイクロソフトの積極的な更新ポリシーと開発チームの作業が限られているため、1.3.711 コード プロジェクトをコンパイルしたり、1.3.6 ローカル インストール パッケージを実行したりすることはできなくなりました。 しかし、我々はアプリで暗号化/復号化ページの1.3.711バージョンを構築しました: ヘルプセンター - アーカイブ
zh_hant: 由於微軟的激進更新政策和開發團隊有限的精力，現在已經無法編譯1.3.711的代碼工程，也無法運行1.3.6的本地安裝包。 但是我們在應用中內置了1.3.711版本的加密/解密頁面 訪問方式：説明中心->存檔

# textblock4.Text
source: Time remaining:
de: Zufälliger Build: Es verwendet die Zufallszahlen-API des Systems, um einen geheimen Schlüssel zu generieren, unter Berücksichtigung nachfolgender Updates verwenden wir AA am Anfang
fr: Construire aléatoire: Il utilise l'API de nombre aléatoire du système pour générer une clé secrète, en tenant compte des mises à jour ultérieures que nous utilisons AA au début
ja_jp: ランダムビルド:システムの乱数APIを使用して秘密キーを生成し、最初にAAを使用する後続の更新を考慮します。
zh_hant: 隨機生成：它使用系統的亂數API生成隨機密匙，考慮到後續更新我們使用AA開頭

# textblock40.Text
source: Please convert all encrypted old versions of files into new format files as soon as possible, and we can only maintain support for older files within our capabilities. 1.5.23 version In order to be down-compatible with the operating system, the file encoding was changed from the default code to UTF-8, very few users who could not decrypt the prompt file corruption, please contact the developer for 1.5.21 beta
de: Bitte konvertieren Sie alle verschlüsselten alten Versionen von Dateien so schnell wie möglich in neue Formatdateien, und wir können nur Die Unterstützung für ältere Dateien innerhalb unserer Fähigkeiten beibehalten. 1.5.23 Version Um mit dem Betriebssystem nicht kompatibel zu sein, wurde die Dateicodierung vom Standardcode auf UTF-8 geändert, sehr wenige Benutzer, die die Fehlersuche nicht entschlüsseln konnten, wenden Sie sich bitte an den Entwickler für 1.5.21 Beta
fr: S'il vous plaît convertir toutes les anciennes versions cryptées de fichiers en nouveaux fichiers de format dès que possible, et nous ne pouvons maintenir la prise en charge pour les fichiers plus anciens dans nos capacités. 1.5.23 version Afin d'être down-compatible avec le système d'exploitation, l'encodage de fichier a été changé du code par défaut à UTF-8, très peu d'utilisateurs qui ne pouvaient pas déchiffrer la corruption de fichier rapide, s'il vous plaît contacter le développeur pour 1.5.21 bêta
ja_jp: 暗号化された古いファイルの全てのバージョンをできるだけ早く新しい形式のファイルに変換してください。 1.5.23バージョンオペレーティングシステムとのダウン互換性を持つために、ファイルエンコーディングはデフォルトのコードからUTF-8に変更されましたが、プロンプトファイルの破損を復号化できなかったユーザーはごくわずかですので、1.5.21ベータ版の開発者にお問い合わせください。
zh_hant: 請儘快將所有加密的舊版本的檔轉化成新格式的檔,我們只能在能力範圍內維持對舊檔的支援。 1.5.23版本為了向下相容作業系統，檔編碼由預設編碼換成了UTF-8，極個別出現無法解密提示檔損壞的使用者，請聯繫開發者獲取1.5.21測試版

# textblock41.Text
source: About this app
de: Info zu dieser App
fr: À propos de cette application
ja_jp: このアプリについて
zh_hant: 關於本應用程式

# textblock42.Text
source: The app uses a smooth design system, so users with Windows 10 versions below 14399 receive another installation package 1.3.711, and the versions of the two installation packages no longer match. Due to six large system updates, coupled with the limited capacity of this team, please update to the new version of the system as soon as possible (17763)
de: Die App verwendet ein reibungsloses Designsystem, sodass Benutzer mit Windows 10-Versionen unter 14399 ein weiteres Installationspaket 1.3.711 erhalten und die Versionen der beiden Installationspakete nicht mehr übereinstimmen. Aufgrund von sechs großen System-Updates, gekoppelt mit der begrenzten Kapazität dieses Teams, aktualisieren Sie bitte so schnell wie möglich auf die neue Version des Systems (17763)
fr: L'application utilise un système de conception lisse, de sorte que les utilisateurs avec Windows 10 versions ci-dessous 14399 recevoir un autre paquet d'installation 1.3.711, et les versions des deux paquets d'installation ne correspondent plus. En raison de six grandes mises à jour du système, couplé avec la capacité limitée de cette équipe, s'il vous plaît mettre à jour à la nouvelle version du système dès que possible (17763)
ja_jp: このアプリはスムーズな設計システムを使用しているため、14399 未満の Windows 10 バージョンを持つユーザーは別のインストール パッケージ 1.3.711 を受け取り、2 つのインストール パッケージのバージョンが一致しなくなります。 6 つの大規模なシステム更新プログラムと、このチームの限られた容量を組み合わせて、できるだけ早くシステムの新しいバージョンに更新してください (17763)
zh_hant: 應用使用流暢設計體系，因此Windows 10 版本低於14399的使用者會收到另一個安裝包1.3.711，這兩個安裝包的版本不再一致。 由於跨越六個大的系統更新，加之本團隊能力有限請儘快更新至新版本系統（17763）

# textblock43.Text
source: The current version contains English, Japanese, German, French, traditional Chinese, you can go to the system Settings to switch languages
de: Die aktuelle ausgabe enthält englisch, japanisch, Deutsch, französisch und chinesisch und ist verfügbar, um umgehende sprachen auszuwählen
fr: La version actuelle contient les versions traditionnelles de l’anglais, du japonais, de l’allemand, du français et du chinois
ja_jp: 现在バージョンは英语、日本语、ドイツ语、フランス语、中国语の繁体语が含まれており、システムに切り替え言语が设置されている
zh_hant: 當前版本包含英語，日語，德語，法語，中文繁體，可以前往系統設置切換語言

# textblock44.Text
source: For Windows 10 Mobile users, we have now successfully adapted to the Anniversary Update (14399), please upgrade to the latest system
de: Für Windows 10 Mobile-Benutzer haben wir uns jetzt erfolgreich an das Anniversary Update (14399) angepasst, aktualisieren Sie bitte auf das neueste System
fr: Pour Windows 10 utilisateurs mobiles, nous avons maintenant réussi à adapter à la mise à jour anniversaire (14399), s'il vous plaît passer au dernier système
ja_jp: 对于Windows 10 Mobile用户，目前我们已经成功适配到周年更新版本（14399），请升级到最新系统
zh_hant: 對於Windows 10 Mobile使用者，目前我們已經成功適配到周年更新版本（14399），請升級到最新系統

# textblock45.Text
source: Disclaimer
de: Haftungsausschluss
fr: Clause d'exclusion de responsabilité
ja_jp: 免責事項
zh_hant: 免責聲明

# textblock46.Text
source: We ensure that this application is thoroughly tested, but do not guarantee that the application will function properly at all times, nor that the encryption/decryption results are correct. Please contact us in the first place after any problems occur and we will make repairs and compensation within our capabilities. We do not warrant the accuracy and completeness of the translated text, i.e. we are not responsible for any loss caused by the instructions in English that cause you to misunderstand and cause some damage.
de: Wir stellen sicher, dass diese Anwendung gründlich getestet wird, aber garantieren nicht, dass die Anwendung jederzeit ordnungsgemäß funktioniert, noch dass die Verschlüsselungs-/Entschlüsselungsergebnisse korrekt sind. Bitte kontaktieren Sie uns in erster Linie, nachdem Probleme auftreten und wir werden Reparaturen und Entschädigung im Rahmen unserer Möglichkeiten vornehmen. Wir übernehmen keine Gewätsskraft für die Richtigkeit und Vollständigkeit des übersetzten Textes, d.h. wir sind nicht verantwortlich für Verluste, die durch die Anweisungen in englischer Sprache verursacht werden, die Sie zu Missverstehen und Zufall von Schäden führen.
fr: Nous nous assurons que cette application est testée à fond, mais ne garantissons pas que l'application fonctionnera correctement en tout temps, ni que les résultats de chiffrement/décryptage sont corrects. S'il vous plaît contactez-nous en premier lieu après tout problème se produisent et nous ferons des réparations et des compensations dans nos capacités. Nous ne justifions pas l'exactitude et l'exhaustivité du texte traduit, c'est-à-dire que nous ne sommes pas responsables de toute perte causée par les instructions en anglais qui vous font mal comprendre et causer des dommages.
ja_jp: 私たちは、このアプリケーションが徹底的にテストされていることを保証しますが、アプリケーションが常に正しく機能し、暗号化/復号化の結果が正しいことを保証しません。 問題が発生した後、最初にご連絡ください、私たちは私たちの能力内で修理や補償を行います。 翻訳されたテキストの正確性および完全性を保証するものではありません。
zh_hant: 我們確保對此應用進行了全面測試，但是不擔保此應用在任何時候都運行正常，也不擔保加密/解密結果的正確性。 發生任何問題後請在第一時間聯繫我們，我們會做出能力範圍內的修復和補償。 我們不對翻譯的文字的準確性和完整性做出擔保，即由於英文的提示說明使你誤解並造成了一定損失，我們不承擔任何責任

# textblock5.Text
source: Add a Folder
de: Hinweis: Der gleiche verschlüsselte Text oder Datei entschlüsselungsschlüsseln Schlüssel und Verschlüsselungsschlüssel sind die gleichen! Denken Sie daran, den Schlüssel, es gibt derzeit keine Möglichkeit, es abzurufen!
fr: Remarque : La même clé de décryptage de texte ou de fichier cryptée et la même clé de chiffrement sont les mêmes ! Gardez à l'esprit la clé, il n'y a actuellement aucun moyen de le récupérer!
ja_jp: 注: 同じ暗号化されたテキストまたはファイルの復号化キーと暗号化キーは同じです。 キーを念頭に置いて、現在それを取得する方法はありません!
zh_hant: 注意：同一個加密文本或檔的解密密匙和加密密匙是同一個！ 請牢記密匙，目前沒有找回密匙的方法！

# textblock6.Text
source: Speed
de: Wir empfehlen den Standardschlüssel nicht aus Sicherheitsgründen, sondern aus Angst, dass Sie den Schlüssel vergessen und wertvolle Dateien verlieren!!!
fr: Nous recommandons la clé par défaut non pas pour des raisons de sécurité, mais de peur que vous oubliez la clé et perdre des fichiers précieux!!!
ja_jp: セキュリティ上の理由ではなく、キーを忘れて貴重なファイルを失うことを恐れて、デフォルトのキーをお勧めします!!!
zh_hant: 我們推薦使用預設密匙並不是出於安全的考慮，而是擔心你會忘記密匙從而丟失寶貴檔！！！

# textblock7.Text
source: Results here, click Save
de: Verschlüsselungsalgorithmen (symmetrische Verschlüsselung)
fr: Algorithmes de chiffrement (cryptage symétrique)
ja_jp: 暗号化アルゴリズム (対称暗号化)
zh_hant: 加密算法（对称式加密技术）

# textblock8.Text
source: percent complete
de: Konzept: Der grundlegende Prozess der Datenverschlüsselung besteht darin, die ursprüngliche Klartextdatei oder Daten nach einem Algorithmus zu verarbeiten, so dass sie unlesbar ein Code ist, der oft als Redaction bezeichnet wird, so dass er erst eingegeben werden kann, nachdem der entsprechende Schlüssel den originalen Inhalt anzeigen kann, so dass die Daten vor illegalem Diebstahl, Lesezwecken geschützt werden können. Der umgekehrte Prozess des Prozesses ist der Prozess der Entschlüsselung, der die codierten Informationen in seine ursprünglichen Daten konvertiert.
fr: Concept: Le processus de base du cryptage des données est de traiter le fichier ou les données d'origine en texte clair selon un algorithme, ce qui en fait un morceau de code illisible, souvent appelé redaction, de sorte qu'il ne peut être entré qu'après que la clé correspondante peut afficher le contenu original, de manière à protéger les données contre le vol illégal, fins de lecture. Le processus inverse du processus est le processus de décryptage, qui convertit les informations codées en ses données d'origine.
ja_jp: 概念: データ暗号化の基本的なプロセスは、何らかのアルゴリズムに従って元のクリアテキストファイルまたはデータを処理し、コードの一部を読み取り不能にし、対応するキーが元のコンテンツを表示できる後にのみ入力できるようにすることです。 プロセスの逆のプロセスは、エンコードされた情報を元のデータに変換する復号化プロセスです。
zh_hant: 概念：資料加密的基本過程就是對原來為明文的檔或資料按某種演算法進行處理，使其成為不可讀的一段代碼，通常稱為 密文 ，使其只能在輸入相應的金鑰之後才能顯示出本來內容，通過這樣的途徑來達到保護資料不被非法人竊取、閱讀的目的。 該過程的逆過程為解密，即將該編碼資訊轉化為其原來資料的過程。

# textblock9.Text
source: Popular explanation: It's like putting your file in a drawer and locking it, only with the corresponding key to open it (decrypted), and no one else can open it unless it's violent (try ingestalling all the keys in the world)
de: Beliebte Erklärung: Es ist wie ihre Datei in eine Schublade zu legen und sperren, nur mit dem entsprechenden Schlüssel, um es zu öffnen (entschlüsselt), und niemand sonst kann es öffnen, es sei denn, es ist gewalttätig (versuchen, alle Schlüssel in der Welt zu installieren)
fr: Explication populaire: C'est comme mettre votre fichier dans un tiroir et le verrouiller, seulement avec la clé correspondante pour l'ouvrir (décrypté), et personne d'autre ne peut l'ouvrir à moins qu'il ne soit violent (essayez d'installer toutes les clés dans le monde)
ja_jp: 一般的な説明:それは、ファイルを引き出しに入れてロックするようなものですが、対応するキーでのみ開きます(復号化)、暴力的でない限り他の誰もファイルを開けることができない(世界のすべてのキーを取り込んでみて)。
zh_hant: 通俗解釋：這就像把你的檔放進一個抽屜並給它上鎖，只有用對應的鑰匙才能打開這個抽屜（解密），而其他人無法打開這個抽屜，除非通過暴力手段（嘗試遍世界上的所有鑰匙）

# textblock47.Text
source: About download management
de: Informationen zur Downloadverwaltung
fr: À propos de la gestion des téléchargements
ja_jp: ダウンロード管理について
zh_hant: 關於下載管理

# textblock48.Text
source: This part is still under development, the function is very simple, please also use the user's mentality of testing. We plan to update the magnetic link and seed file download function next year. I hope that you can get some guidance in this area and speed up our pace. If you don't want the app to be networked, you can refuse to apply network permissions in the system settings. Thank you for your support.
de: Dieser Teil befindet sich noch in der Entwicklung, die Funktion ist sehr einfach, bitte verwenden Sie auch die Testmentalität des Benutzers. Wir haben vor, die Funktion zum Herunterladen von magnetischen Links und Seed-Dateien im nächsten Jahr zu aktualisieren. Wenn Sie nicht möchten, dass die App vernetzt wird, können Sie die Netzwerkberechtigungen in den Systemeinstellungen verweigern. Vielen Dank für Ihre Unterstützung.
fr: Cette partie est encore en développement, la fonction est très simple, veuillez également utiliser la mentalité de test de l'utilisateur. Nous prévoyons de mettre à jour la fonction de téléchargement des liens magnétiques et des fichiers de semences l’année prochaine.J’espère que vous pourrez obtenir des conseils dans ce domaine et accélérer notre rythme. Si vous ne souhaitez pas que l'application soit mise en réseau, vous pouvez refuser d'appliquer les autorisations réseau dans les paramètres système. Merci de votre soutien.
ja_jp: この部分はまだ開発中です。機能は非常に単純です。また、テストのユーザーの考え方を使用してください。 来年は磁気リンクとシードファイルのダウンロード機能を更新する予定ですので、この分野に関するガイダンスを入手し、ペースを上げてください。 アプリをネットワークに接続したくない場合は、システム設定でネットワーク権限の適用を拒否できます。ご支援ありがとうございます。
zh_hant: 這一部分還在開發中，功能十分簡陋，還請各位用戶以測試的心態去使用。我們計劃明年更新磁力鏈接和種子文件下載功能，希望在這方面有所了解的大佬給我們一些指導，能加快我們的步伐。如果不想讓應用進行聯網操作，可以到系統設置裡拒絕應用網絡權限，感謝你的支持

# AppDisplayName
source: Tool Manager
de: Werkzeuge
fr: Outil
ja_jp: ツール
zh_hant: 加密助手

# biaoti1.Text
source: 欢
zh_hant: 幫

# biaoti2.Text
source: Welcome
de: Help Center
fr: Centre d'aide
ja_jp: ヘルプ センター
zh_hant: 助中心

# guanyu.Text
source: About
de: Wir über uns
fr: Qui sommes-nous ?
ja_jp: 会社紹介
zh_hant: 關於我們

# jiubanben.Text
source: Archive
de: archivieren
fr: archiver
ja_jp: アーカイブ
zh_hant: 封存

# shiyong.Text
source: Manual
de: Manuell
fr: Manuelle
ja_jp: 手動
zh_hant: 使用手册

# textblock14.Text
source: Need help?
de: Verlauf löschen
fr: Effacer l'historique
ja_jp: 履歴のクリア
zh_hant: 清除歷程記錄

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Schlüsselziffern
fr: Chiffres clés
ja_jp: キーディジット
zh_hant: 密匙位數

# String2
source: Paste successful
de: Ungültige Schlüsselziffern
fr: Chiffres clés invalides
ja_jp: 無効なキーディジット
zh_hant: 不正確密匙位數

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Standard
fr: par défaut
ja_jp: 既定値
zh_hant: 預設

# String4
source: Please set the password before encrypting
de: Standard
fr: par défaut
ja_jp: 既定値
zh_hant: 預設

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Ungültiger Algorithmus
fr: Algorithme invalide
ja_jp: 無効なアルゴリズム
zh_hant: 不正確演算法

# String6
source: This text cannot be decrypted, make sure the decryption key and algorithm are correct
de: Ungültige Ziffern
fr: Chiffres invalides
ja_jp: 無効な数字
zh_hant: 不正確位數

# String7
source: Password error, please confirm and try again
de: Ungültiger Algorithmus
fr: Algorithme invalide
ja_jp: 無効なアルゴリズム
zh_hant: 不正確演算法

# String8
source: Replication successful
de: schlüssel
fr: clé
ja_jp: 無効なアルゴリズム
zh_hant: 密匙

# textblock1.Text
source: Enter text
de: Schlüssellänge
fr: Longueur de clé
ja_jp: キーの長さ
zh_hant: 密匙長度

# textblock11.Text
source: Add File
de: Zufällige Generierung
fr: Génération aléatoire
ja_jp: ランダム生成
zh_hant: 隨機生成

# textmcc.Text
source: Use the default encryption/decryption key (recommended)
de: Verwenden des Standardschlüssels
fr: Utiliser la clé par défaut
ja_jp: 既定のキーを使用する
zh_hant: 使用預設密匙

# button1.Content
source: Encoding
de: Datei hinzufügen
fr: Ajouter un fichier
ja_jp: ファイルを追加
zh_hant: 新增檔案

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Ziehen Sie Dateien in den Bereich, um mit der Überprüfung zu beginnen
fr: Faites glisser les fichiers dans la zone pour commencer à vérifier
ja_jp: ファイルを領域にドラッグしてチェックを開始する
zh_hant: 將檔拖拽到該區域內開始校驗

# String10
source: Please go to the home page to decrypt this file<Version is higher than1.3.711>
de: ）.Wenn diese Meldung nach dem erneuten Versuch immer noch angezeigt wird, fragen Sie bitte im Feedback Center nach, und wir werden das Problem so schnell wie möglich untersuchen und beheben.。
fr: ）.Si ce message apparaît toujours après avoir réessayé plus d'une fois, s'il vous plaît demander dans le centre de rétroaction et nous allons enquêter et résoudre le problème dès que possible。
ja_jp: ）.このメッセージが複数回再試行した後も表示される場合は、フィードバックセンターに問い合わせ、できるだけ早く問題を調査して解決します。。
zh_hant: ）.若重試多次後仍然出現這條消息，請在回饋中樞提出，我們會儘快調查並解決問題。

# String11
source: Failed to read file version
de: berechnung
fr: calcul
ja_jp: 計算
zh_hant: 记 算

# String2
source: Paste successful
de: 检测到文件 可以继续添加以覆盖旧文件
fr: Un fichier n'a pas détecté et peut continuer à être ajouté pour remplacer l'ancien fichier
ja_jp: ファイルが検出されず、古いファイルを上書きするために引き続き追加できます。
zh_hant: 檢測到檔 可以繼續添加以覆蓋舊檔

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Eine Datei wurde nicht erkannt und kann weiterhin hinzugefügt werden, um die alte Datei zu überschreiben.
fr: Un fichier n'a pas détecté et peut continuer à être ajouté pour remplacer l'ancien fichier
ja_jp: ファイルが検出されず、古いファイルを上書きするために引き続き追加できます。
zh_hant: 檢測到檔 可以繼續添加以覆蓋舊檔

# String4
source: Please set the password before encrypting
de: Fehler bei der Auswahl der Datei<
fr: Il y a eu une erreur de sélection du fichier<
ja_jp: ファイルの選択中にエラーが発生しました<
zh_hant: 選擇檔時發生錯誤<

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Eine Datei wurde nicht erkannt und kann weiterhin hinzugefügt werden, um die alte Datei zu überschreiben.
fr: Un fichier n'a pas détecté et peut continuer à être ajouté pour remplacer l'ancien fichier
ja_jp: ファイルが検出されず、古いファイルを上書きするために引き続き追加できます。
zh_hant: 檢測到檔 可以繼續添加以覆蓋舊檔

# String6
source: This text cannot be decrypted, make sure the decryption key and algorithm are correct
de: Ziehen und Ablegen hier, um Dateien hinzuzufügen o(^▽^)o
fr: Faites glisser et déposer ici pour ajouter des fichiers o(^▽^)o
ja_jp: ここにドラッグ アンド ドロップしてファイルを追加する o(^▽^)o
zh_hant: 拖放此處即可添加檔 o(^▽^)o

# String7
source: Password error, please confirm and try again
de: Bitte fügen Sie die Datei zuerst hinzu
fr: S'il vous plaît ajouter le fichier d'abord
ja_jp: 最初にファイルを追加してください
zh_hant: 請先添加檔

# String8
source: Replication successful
de: Auswerten
fr: Évaluation
ja_jp: 評価しています
zh_hant: 正在計算...

# String9
source: When entering a password, make sure that the password is entered twice and is less than 60 characters long
de: Fehler in der Nachrichtenzusammenfassung der Datei（
fr: Il y a eu une erreur dans le résumé du message du fichier（
ja_jp: ファイルのメッセージの要約にエラーが発生しました（
zh_hant: 對檔進行消息摘要時發生錯誤（

# textblock1.Text
source: Enter text
de: Ziehen Sie Dateien in den Bereich, um mit der Überprüfung zu beginnen
fr: Faites glisser les fichiers dans la zone pour commencer à vérifier
ja_jp: ファイルを領域にドラッグしてチェックを開始する
zh_hant: 對檔進行消息摘要時發生錯誤 ...

# textblock2.Text
source: Decrypting results
de: Und entweder
fr: Et soit
ja_jp: または
zh_hant: 新增任一個

# String1
source: 在类<tianxiecanshu>方法<Mima_shu_Cuowu>中发生异常<传递的参数无效<
de: Passwort eingeben (optional)
fr: Entrez un mot de passe (facultatif)
ja_jp: パスワードを入力する (オプション)
zh_hant: 輸入密碼（可選）

# String10
source: Please go to the home page to decrypt this file<Version is higher than1.3.711>
de: Geben Sie Ihr Passwort erneut ein
fr: Entrez à nouveau votre mot de passe
ja_jp: もう一度パスワードを入力する
zh_hant: 再一次输入密码

# String11
source: Failed to read file version
de: bestätigen
fr: confirmer
ja_jp: 確認する
zh_hant: 確認

# String12
source: There is a problem decrypting, please ensure that the decryption key, decryption mode, decrypttheor algorithm correctness, check again. If you've seen this tip many times, please report this question to us in the Feedback Center, thank you
de: Geben Sie Ihr Passwort erneut ein
fr: Entrez à nouveau votre mot de passe
ja_jp: もう一度パスワードを入力する
zh_hant: 再一次输入密码

# String13
source: Decryptsuccessful, click on the picture below to save
de: Zurücksetzen
fr: Réinitialiser
ja_jp: リセット
zh_hant: 重設

# String14
source: Please click on the picture above to select the file to decrypt
de: Passwort eingeben (optional)
fr: Entrez un mot de passe (facultatif)
ja_jp: パスワードを入力する (オプション)
zh_hant: 輸入密碼（可選）

# String15
source: There was a problem saving the results, please try again. If this prompt still appears after trying again many times, please feed us back to this issue and we will try our best to resolve it, thank you
de: Nutzung
fr: utilisation
ja_jp: 付き
zh_hant: 入侵程式

# String16
source: Save successful
de: bestätigen
fr: confirmer
ja_jp: 確認する
zh_hant: 確認

# String17
source: Please encrypt/decrypt first
de: Hier ist Ihr Passwort.
fr: Voici votre mot de passe.
ja_jp: ここにパスワードがあります。
zh_hant: 這是你的密碼

# String18
source: Congratulations, the key length has reached the required 40 characters
de: Zurücksetzen
fr: Réinitialiser
ja_jp: リセット
zh_hant: 重設

# String19
source: Congratulations, the key length has reached the required 40 characters
de: Passwort eingeben (optional)
fr: Entrez un mot de passe (facultatif)
ja_jp: パスワードを入力する (オプション)
zh_hant: 輸入密碼（可選）

# String2
source: Paste successful
de: Nutzung
fr: utilisation
ja_jp: 付き
zh_hant: 入侵程式

# String20
source: Password is too long, should be between 0 to 20 characters
de: Nutzung
fr: utilisation
ja_jp: 付き
zh_hant: 入侵程式

# String21
source: Your passwords do not match
de: Kennwortfehler, bestätigen Sie und versuchen Sie es erneut
fr: Erreur de mot de passe, s'il vous plaît confirmer et essayer à nouveau
ja_jp: パスワードエラー、確認してもう一度やり直してください
zh_hant: 密碼錯誤，請確認後重試

# String22
source: Re-enter password
de: Geben Sie das Kennwort erneut ein.
fr: Retaper le mot de passe
ja_jp: パスワードを再入力してください
zh_hant: 重新輸入密碼

# String3
source: Click < 使用 > 按钮以确认密码无误
de: Geben Sie Ihr Passwort erneut ein
fr: Entrez à nouveau votre mot de passe
ja_jp: もう一度パスワードを入力する
zh_hant: 再一次輸入密碼

# String4
source: Please set the password before encrypting
de: bestätigen
fr: confirmer
ja_jp: 確認する
zh_hant: 確認

# String5
source: The text you entered doesn't fit the new format, and to decrypt the old text, visit Archive
de: Hier ist Ihr Passwort.
fr: Voici votre mot de passe.
ja_jp: ここにパスワードがあります。
zh_hant: 這是你的密碼

# String6
source: This text cannot be decrypted, make sure the decryption key and algorithm are correct
de: Zurücksetzen
fr: Réinitialiser
ja_jp: リセット
zh_hant: 重設

# String7
source: Password error, please confirm and try again
de: 在类<mima_shuru>方法<Mimazhuangtai.get>中发生异常<传递的参数无效<
fr: 在类<mima_shuru>方法<Mimazhuangtai.get>中发生异常<传递的参数无效<
ja_jp: 在类<mima_shuru>方法<Mimazhuangtai.get>中发生异常<传递的参数无效<
zh_hant: 在类<mima_shuru>方法<Mimazhuangtai.get>中发生异常<传递的参数无效<

# String8
source: Replication successful
de: Das Kennwort darf nicht leer sein.
fr: Le mot de passe ne peut pas être vide.
ja_jp: パスワードは空白にはできません
zh_hant: 密碼不能留空白
